{
  "url_hash": "a52d8cc7",
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business-news/Ceylon-Chamber-tells-President-ready-to-promote-business-with-country-returning-to-normalcy/273-216981",
  "ut": 1627434180,
  "time_id": "2021-07-28-0103",
  "title": "Ceylon Chamber tells President ready to promote business with country returning to normalcy",
  "paragraphs": [
    "The Ceylon Chamber of Commerce (CCC) has assured President Gotabaya Rajapaksa that it is eager to promote a number of sectors, including exports and tourism, as soon as the country returns to normalcy with its vaccination drive, according to a media communiqué issued by the President’s Media Division.",
    "The President has implemented the policies listed in the ‘Vistas of Prosperity and Splendour’ National Policy Framework amidst the COVID-19 pandemic. The CCC had pointed out that it can take advantage of this and contribute to the rapid development of the economy.",
    "The newly-elected office-bearers of the Ceylon Chamber of Commerce stated this at a meeting held with the President at the Presidential Secretariat yesterday. The Ceylon Chamber of Commerce was established in 1839 and currently, it has 560 member companies. The Regional Chambers of Commerce have expanded to cover all parts of the country.",
    "The newly elected office bearers commended the President’s efforts to bring the country back to normalcy through the vaccination programme. Infrastructure has been rapidly developed, especially the road network. They pointed out that its benefits would greatly enhance investment opportunities in the near future.",
    "The officials of the CCC highlighted the possibility of expanding export opportunities by entering into a free trade agreement with the UK.",
    "The officials said the National Agenda Committees of the CCC have paid special attention to the government’s programmes implemented to promote sustainable energy, agriculture and the field of technology.",
    "The investors are discouraged by some of the laws and regulations that are in effect. The President had said one of the main objectives of the government is to remove such obstacles and to encourage exports by preventing corruption and malpractices through the introduction of digitalization.",
    "The President had also said that the government’s responsibility is to create employment opportunities and pointed out the need to provide opportunities for the new generation to come forward as entrepreneurs and business persons. Secretary to the President P. B. Jayasundera, Economic Policies & Plan Implementation Ministry Secretary Anusha Pelpita and other officials, former Chairman of Ceylon Chamber of Commerce Hans Wijesuriya, new Chairman Vish Govindasamy and the new office bearers of the Ceylon Chamber of Commerce were present at the event."
  ]
}