{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business-news/NTBs-unlisted-debenture-oversubscribed-upon-opening/273-216939",
  "ut": 1627359120,
  "time_id": "2021-07-27-0412",
  "title": "NTB’s unlisted debenture oversubscribed upon opening",
  "paragraphs": [
    "Nations Trust Bank PLC (NTB) yesterday announced the successful oversubscription of its unlisted debenture prior to its opening, aggregating Rs.5 billion in applications.",
    "Structured, managed and placed internally, the bank planned to raise up to Rs.3 billion throu gh the issue of 30 million unlisted, rated, unsecured, senior, redeemable debentures, at the par value of Rs.100 each.",
    "Approved by the Securities and Exchange Commission of Sri Lanka and announced in June 2021, the issue was structured by NTB’s Structured Finance Unit and its management and placement was done by the bank’s Treasury Unit.",
    "The bank had options to issue up to further 10 million debentures, valued up to Rs.1 billion, in the event of an oversubscription of the initial issue and succeeded in exceeding the initial offer value by Rs.2 billion.",
    "Commenting on the oversubscription of the debenture issue, NTB Chief Executive Officer/Director Priyantha Talwatte stated, \"This unlisted debenture issue’s success is a testament to investor confidence in NTB’s financial stability and the capabilities.",
    "One of the key objectives of the issue is to utilise the provided medium-term stable funding towards the expansion of the bank’s lending portfolio. We hope that the funds would further reduce the tenor mismatch between the shorter-term liabilities and medium-term assets and overall, strengthen the bank’s funding profile.\"",
    "Under the issue, the bank offered two types of debentures: Type A – a five-year tenure, with a fixed rate of 8.9 percent per annum and interest paid semi-annually and Type B – a five-year tenure, with a fixed interest rate of 9.15 percent payable annually."
  ]
}