{
  "url_hash": "7f0f86ef",
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/There-is-nexus-between-JVP-and-agrochemical-companies/108-216949",
  "ut": 1627369440,
  "time_id": "2021-07-27-0704",
  "title": "There is nexus between JVP and agrochemical companies",
  "paragraphs": [
    "Agriculture Minister Mahindananda Aluthgamage said the rice prices would be brought down drastically next week in accordance with the agreement to be signed with the mill owners.",
    "The Minister told Daily Mirror that the mill owners had agreed to purchase paddy from farmers at Rs.50-52 a kilo. He said a similar agreement would be reached with them for the supply of rice at controlled prices.",
    "\"Once that agreement is signed, we will be able to sell rice (Nadu variety) at less than Rs.100 a kilo. In Sri Lanka, there are one million farmers. However, we have more than 20 million owners. More than 80 per cent of them consume rice of Nadu variety. Today, a kilo of Samba rice is Rs.150 and Keeri Samba Rs.225. We will bring them down by Rs.50-75 a kilo,\" he said.",
    "The Minister charged that the JVP had instigated farmers asking for a price hike. However, he said paddy was sold at Rs.30 a kilo during the time of the Yahapalana government, but the JVP maintained stoic silence.",
    "\"At that time, the JVP was clinging to that government for benefits.",
    "So, they maintained silence. Today, the Jvp-affiliated All Ceylon Peasants’ Association led by Namal Karunaratne has been jolted out of a deep slumber to voice for farmers. I am asking where he and his JVP were at that time. The JVP remained mute because it got inducements from the Yahapalana government,\" he said.",
    "He also charged that there is a nexus between the JVP and chemical fertilizer suppliers.",
    "\"That is why there are farmer agitations instigated by the JVP demanding chemical fertilizer. Even JVP leader Anura Kumara Dissanayake, in his election manifesto, promised to introduce organic agriculture. Now, he speaks otherwise. Sri Lanka is the only country with the opposition working against organic products for people. There is a nexus between the JVP and agrochemical companies,\" he said."
  ]
}