{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/expose/How-powerful-Acting-Principals-rule-the-roost/333-215464",
  "ut": 1625547240,
  "time_id": "2021-07-06-0454",
  "title": "How powerful Acting Principals rule the roost",
  "paragraphs": [
    "Vacancies for Principals in local schools are yet to be filled. Trade Union representatives complain that many issues have arisen due to the appointment of acting principals in place of qualified ones. As a result, the school system has collapsed and the Government is attempting to grant permanent appointments to 4600 acting principals through a Cabinet decision without holding a competitive examination or an interview, they added. Nuwara Eliya District Secretary of the Sri Lanka Teachers’ Union, Manjula Suraweeraarachchi said that there is a hidden agenda behind the action taken by the Government to grant permanent appointments to acting principals through a Cabinet decision on March 1. Suraweeraarachchi also said that the Government is using the education sector to carry out its political propagandas.",
    "\"Everybody respects the Constitution and is bound to safeguard it. Trade Union representatives said that principals should not be appointed if such appointments stray beyond the structural procedure. There is a Service Minute for teachers, principals, education administrative officers and educators based on which appointments, promotions and other processes relating to those titles are made. However, on March 1 the Government attempted to grant permanent positions to acting principals who are performing the duties of principals,\" Suraweeraarachchi added.",
    "\"There is a Service Minute for teachers, principals, education administrative officers and educators based on which appointments, promotions and other processes relating to those titles are made. However, on March 1 the Government attempted to grant permanent positions to acting principals who are performing the duties of principals - Manjula Suraweeraarachchi Secretary of the Nuwara Eliya District Sri Lanka Teachers Union \"",
    "\"Principals should be appointed to Grade III, II, and I according to the Service Minute of the Sri Lanka Principals Service dated 23.10.2014 and teachers must sit for a competitive examination. The Government is attempting to grant permanent appointments to acting principals without holding competitive exams citing the COVID-19 situation as an excuse. Every trade union -representing teachers, principals, educators and education administrative officers- is against this decision, he added.",
    "\"This action can violate the rights of talented teachers who wish to become principals. Their talents have been overshadowed by the needs of politicians. Acting principals are granted 5 marks each year for six years in honour for their service in difficult areas at the interview following the competitive examination. Following this procedure an attempt has been made to grant principal appointments to half of a total number of 10,106 schools which comprise the school system; due to a political agenda. This affects not only the Service Minutes of the education sector, but also the whole school system. There are members in our union who are Acting principals and that does not matter to us. We only expect these appointments to be granted according to the current legal process and the Service Minute. If there are faults in the Service Minute, a solution can be arrived at following discussions. The available procedure should not be changed due to various political propagandas and if this decision is to be implemented it might affect the future of the country, children and principals.",
    "\"There are individuals who have failed the principal examination thrice among the 4600 acting principals who are to be made permanent. Those who cannot pass competitive examinations are attempting to stick to their positions with the aid of politicians. If this continues what would become of the future is uncertain. Therefore, we are strictly against these illegal appointments. There are 17,000 principals in Sri Lanka. Most of the principals appointed in 2009, 2012 and 2016 don’t have schools to serve in. They should be given schools to improve education instead of promoting Acting principals to Grade I and III.",
    "\"In 2018 the Yahapalana Government attempted to grant 1014 appointments to principals claiming that it was done to address the issue of political vengeance. We protested and managed to halt the granting of these appointments through the Public Service Commission. In the same manner the present Government is trying to grant appointments to its supporters using the COVID-19 pandemic as an excuse. We are not sure why the Government, which didn’t hesitate to hold the Scholarship, O/L and A/L exams are hesitating to hold the exams to appoint principals. We have temporarily halted our protests in an environment where schools are closed due to COVID-19. We will restart protests once schools open.\" he added.",
    "Govt’s claim can’t be accepted",
    "Sri Lanka Teachers’ Union Secretary Joseph Stalin said that the four education services in Sri Lanka namely Sri Lanka Education Administrative Service, Sri Lanka Teacher Educator Service, Sri Lanka Principals Service and Sri Lanka Teachers Service have four different Service Minutes which specify recruitment procedures. \"This procedure has been disregarded in the appointment of candidates to Sri Lanka Principals Service. Principals are appointed after a competitive examination and the ones who pass the exam are selected for interviews. Members of the Teachers Service can sit for the exam and this has been the procedure so far.",
    "\"The Cabinet of Ministers has granted approval for the permanent appointments of Acting principals with effect from March 1, 2021. The Government claims that this procedure has been adopted due to the inability to hold competitive examinations due to the current COVID-19 situation. But the Government was able to hold the Scholarship, O/L and A/L exams after the second wave ceased. Therefore, the claim made by the Government cannot be accepted. The Government wants to grant permanent appointments to those acting principals who canvased for the Government party. The Government is trying to justify its actions by bringing to light years long service of such acting principals in difficult areas and their service in schools in difficult areas during the war as reasons for making 4600 acting principals permanent. Such claims cannot justify granting appointments without competitive exams. They have been performing as acting principals while being in the Teacher Service. If this method continues the whole school system would collapse.",
    "\"I was informed to take the necessary steps to grant them permanent appointments through interviews conducted at provincial level. This policy decision was taken after the Education Ministry made suggestions to the Cabinet. I am vested with the power to implement that decision with the approval of the Public Service Commission - Prof. Kapila Perera Education Ministry Secretary \"",
    "\"This situation arose because the process of teachers receiving principal appointments was not completed properly by giving them schools to serve as well. The letters of appointment of acting principals clearly state that the position is only temporary and the position should be given up once a principal with a grade is appointed. But the acting principals are unwilling to give up on their positions due to their connections with those who wield political power. 7000 Principals were appointed in 2009 after conducting competitive examinations for Grade III, II-11. Another 2000 principals were appointed in 2016. In 2019 another 2000 acting principals were appointed. Those who were in service in difficult areas during the war were given appointments. Principal vacancies are gazetted after also taking into consideration vacancies that exist in schools where there are acting principals. Providing schools for those who pass this examinations for principals is the proper method,\" said Stalin. The Government is trying to grant permanent appointments to acting principals who are its henchmen. The war concluded in 2009. Acting principals serving during that period were given 30 marks for their service in difficult areas.",
    "They faced interviews with those marks. During the tenure of Education Minister Bandula Gunawardena 2353 acting principals, serving in difficult areas and not appointed as principals, were given appointments in 2011 through a Cabinet subcommittee which included Maithripala Sirisena, Nimal Siripala, Dinesh Gunawardena, Susil Premajayantha. This subcommittee in its report states that this appointment shouldn’t be taken as an example and in future competitive examinations must be held in the process of appointing principals. \"All Trade Unions are against this process which goes against Service Minute and appoints principals. We displayed a huge protest in front of the Education Ministry and will continue to protest in the future. We have nothing against the acting principals. But appointments cannot be granted against the Service Minute. Giving appointments to those who have failed exams is illegal and all Trade Unions are ready to oppose that decision. Nobody can handle these procedures at their own discretion.\" he protested.",
    "Education Ministry Secretary Prof. Kapila C. K. Perera said that 4533 acting principals are to be made permanent through a policy decision by the Cabinet and this has been announced. \"I was informed to take the necessary steps to grant them permanent appointments through interviews conducted at provincial level. This policy decision was taken after the Education Ministry made suggestions to the Cabinet. I am vested with the power to implement that decision with the approval of the Public Service Commission. I am currently working on that implementation and I will have to carry out the instructions given by the Cabinet.",
    "\"Those who were in service in difficult areas during the war were given appointments. Principal vacancies are gazetted after also taking into consideration vacancies that exist in schools where there are acting principals. Providing schools for those who pass this examinations for principals is the proper method - Joseph Stalin Secretary of the Sri Lanka Teachers’ Union\"",
    "\"There is a total number of 10165 schools. There are 64 Grade 1 schools, 85 Grade II schools and 224 Grade III schools in the Education Administrative Service. The rest are Provincial schools. National schools have Principals, Deputy Principals and Assistant Principals. Principals are available only in 10165 schools with 4533 vacancies filled by Acting principals. These appointments are made to fill those vacancies.",
    "Allegations against acting principals",
    "There are allegations against acting principals such as gaining profits by cultivating school lands, evading their duties and obtaining bribes when admitting students. Audit officers complained that even though audits are conducted following complaints that are received the education authorities are not taking action. An Audit officer from Kandy district said that some of these allegations were revealed during audits conducted in several National and Provincial schools in Kandy.",
    "\"There are 22 acting principals in Wattegama Division with 24 additional principals. There are eight principals in Walala Rathnayaka Vidyalaya even though the number should be only three. There are nine Principals in Kandy Adarsha Vidyalaya, four in Samudradevi Vidyalaya and four in Pologolla Maha Vidyalaya. There have been 18 acting principals in Pologolla division from 2010 – 2014. There are 68 additional principals in Kandy. Vidyartha College has 12 and Sumangala Vidyalaya has 15. Despite audit reports regarding acts by them that breached discipline were handed over to the Provincial Secretary no action has been taken yet. There is no use informing the Provincial Directors of Education either. They are simply avoiding their responsibilities.\" he added.",
    "Central Province Director of Education E. P. T. K. Ekanayaka said that Graded Principals are appointed in place of acting principals according to Circular No 2021/06 and vacancies would be filled based on the instructions of the Ministry of Education. \"No more acting principals will be appointed for schools in the Central Province. I haven’t yet received any complaint regarding any Principal.\" he added."
  ]
}