{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/in_conversation_with_hirushi_jayasena/FEATURING-AKRAM-CASSIM/434-216770",
  "ut": 1627106460,
  "time_id": "2021-07-24-0601",
  "title": "FEATURING: AKRAM CASSIM",
  "paragraphs": [
    "Welcome readers! I hope that all of you are safe and well, while adhering to all responsibilities during these challenging times. Today, I am featuring a special individual who has energized a spectacular legacy in jewellery making and has incorporated his business into addressing and supporting many domains including women empowerment, environmental conservation, wildlife protection, and many other avenues. This season he is taking a new leap in sharing with you, the ultimate reference in luxury chronograph watches, ornamented with some of the biggest eras in sporting history since 1860. I warmly welcome Akram Cassim, CEO and Managing Director of Colombo Jewellery Stores to talk about his latest boutique opening for Tag Heuer at the One Galle Face Mall, Colombo.",
    "Congratulations on the launch of the newest Tag Heuer boutique at One Galle Face! How has the response been so far?",
    "Thank you Hirushi. The response has been very good from the crowd coming into the Mall. The TAG Boutique was something that a lot of watch enthusiasts were waiting for at the mall. The 400 square-feet space of the boutique has been appointed according to the Global TAG Heuer Boutique Design concept. The outcome is a sleek and immersive interior which evokes emotions that tie into the brand’s four areas of expression; sport, lifestyle, art and heritage.",
    "What inspired you to bring out the distinctiveness of the brand by creating its own boutique store?",
    "Since our launch of TAG Heuer in Sri Lanka in 2003, I have taken special pride in seeing the brand grow to be desired by a wide cross-section of discerning customers. With the opening of this boutique, we look forward to offering our local and international visitors an immersive and memorable journey into the different territories of our brand as introduced through our distinctive watch collections. The future for TAG Heuer in Colombo looks very bright indeed.",
    "From your perspective, we would like to hear a little bit about what Tag Heuer is all about.",
    "TAG Heuer was founded in 1860 in Switzerland and over the past 160 years has been producing some amazing time-pieces and is today, amongst the leading luxury watch brands in the world. A Brand associated with mastering time and precision and producing reliable watches and chronographs. A pioneer in the field of sports timing from Motor Racing, Olympics, Alpine Skiing, Sailing, and also now moving in to the field of Connected Watches partnering up with Google.",
    "How has the experience been so far working with Tag Heuer? What are some memorable milestones if any that you’d like to recollect on?",
    "It has been amazing working with the TAG Heuer Brand over the years since we launched TAG Heuer in Sri Lanka in 2003. I have enjoyed attending some interesting brand events with TAG Heuer and meeting the assortment of amazing ambassadors the Brand has had at various times, stars from the film world like Shah Rukh Khan, Priyanka Chopra, Sushmitha Sen , Ranbir Kapoor, Brad Pitt, Chris Hemsworth, Uma Thurman, to sporting stars like Maria Sharapova, Tiger Woods, Lewis Hamilton, Kimi Raikkonen, and attending some Formula 1 race events and all the fun and frolic at the Baselworld launches over the years",
    "As someone committed to the franchise, what elements of the brand are significant to you?",
    "Precision and reliability of the TAG Heuer Watches. The Spirit of Innovation of the Brand. A brand that is always looking at new ways to improve in every area of watch making. The support given for Training on an App, plus the brilliant marketing of each new collection.",
    "What are some of the exciting models that are lined up at the moment?",
    "Some of the brand’s most iconic watch lines are being showcased at the store including the TAG Heuer Carrera, Aquaracer, Formula-1, Monaco, Link and the Connected series. The Carrera and the Connected ranges will be presented on unique backdrop designs that represent their respective heritage and personality. My favourite piece at the TAG Heuer Boutique is the limited edition TAG Heuer Carrera 02 Tourbillon Nanograph , a special boutique edition 1 of 500 pieces manufactured worldwide."
  ]
}