{
  "url_hash": "68eaf40d",
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business/Message-by-His-Excellency-President-Ibrahim-Mohamed-Solih-President-of-the-Republic-of-Maldives/215-216870",
  "ut": 1627291500,
  "time_id": "2021-07-26-0925",
  "title": "Message by His Excellency President Ibrahim Mohamed Solih, President of the Republic of Maldives",
  "paragraphs": [
    "As the people of the Maldives celebrate the happy occasion of the 56th anniversary of our independence, I am happy to extend my warm felicitations and good wishes to all the Maldivians residing in Sri Lanka. As we celebrate this year’s Independence Day, we find ourselves still engaged in the task of overcoming the challenges posed by the Covid-19 global pandemic. The past 14 months have caused great distress not just for Maldivians and Sri Lankans, but to everyone around the world. Despite the progress in containing the latest outbreaks of the virus, and successful vaccine rollout in the country, there is still a lot more to be done. We are all trying our best to continue with our lives, whilst heeding the guidelines recommended by health experts. By the Grace of Almighty Allah, I hope our countries will soon overcome and recover from the challenges caused by this pandemic, and will be able to celebrate our national days with festive gatherings soon.",
    "Today also coincides with the happy occasion of the 56th anniversary of establishing diplomatic relations with our closest neighbour, Sri Lanka. On this joyful occasion, let me convey warm felicitations and deep appreciation to the President of Sri Lanka, His Excellency Gotabaya Rajapaksa and Prime Minister, His Excellency Mahinda Rajapaksa, for their unwavering support and contribution in sustaining the historic relationship and special bonds of friendship between our two countries.",
    "Sri Lanka has always been a loyal friend and a steadfast partner in the development journey of the Maldives. We express our sincere gratitude for the assistance and support extended by the Government and the people of Sri Lanka to the Maldives over the past five decades. I am confident that the existing ties of friendship and cooperation between our two countries will continue to go from strength to strength in the years to come.",
    "Covid-19 has shown the necessity for even closer cooperation not only between us neighbours, but also with other regional and international partners. I am certain that our two Governments and peoples will continue to work together to build a more resilient, equitable and inclusive world for all, while overcoming the challenges of the Covid-19 pandemic. I wish for continued peace, progress, prosperity and good health for all Maldivians and the friendly people of Sri Lanka."
  ]
}