{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business/Message-by-His-Excellency-Omar-Abdul-Razzak-High-Commissioner-of-the-Republic-of-Maldives-to-the-Democratic-Socialist-Republic-of-Sri-Lanka/215-216858",
  "ut": 1627288320,
  "time_id": "2021-07-26-0832",
  "title": "Message by His Excellency Omar Abdul Razzak High Commissioner of the Republic of Maldives to the Democratic Socialist Republic of Sri Lanka",
  "paragraphs": [
    "Independence Day is a celebration of expression for the spirit of love, peace, and harmony. Let me take this opportunity to extend my heartfelt greetings and best wishes to all Maldivians, on our 56th Anniversary of Independence Day, especially to Maldivians residing here in Sri Lanka. As we also celebrate the anniversary of 56 years of fortunate establishment of Diplomatic Relations between Maldives and Sri Lanka, I would like to send warm greetings on the occasion, and acknowledge the mutually shared close cooperation and unwavering support exchanged between our countries.",
    "The history of the relationship shared by Maldives and Sri Lanka dates back much further, even than the establishment of Diplomatic Relations 56 years ago. Our rich history depicts, Maldives and Sri Lanka shared economic relation through trade, from time immemorial. I am delighted that we were able to strengthen and enhance these bonds especially during the COVID-19 pandemic, overcoming the challenges, and for the continued support in providing assistance on mutually beneficial grounds.",
    "As we all approach to a ‘New Normal’, after more than a year of going through unprecedent events which unfolded due to COVID-19 Pandemic, I am very hopeful that we can now safely adhere to address the most vulnerable areas to mitigate further socio-economic impacts and revive our economies. I believe that implementation of new strategies in creating jobs and income opportunities, paving ways to more productive and effective methodologies to recover travel and tourism, enhance universal health coverage and social protection, is the key to ensure a more secure and protective communities for both Sri Lanka and Maldives.",
    "Sri Lanka is our closest neighbor, many Maldivians travel to seek medical treatments, higher education, for leisure purposes and a second home for most Maldivians. I am confident that, despite our small population, Maldivians play a part in contributing to the revival of Sri Lanka. In this regard, let me take this opportunity to convey my sincere gratitude and appreciation to the Government of Sri Lanka for facilitating arrivals and medical treatment for Maldivian critical patients even during a time where the whole world experienced travel restrictions across borders in response to the COVID-19 pandemic. The assistance and guidance provided is commendable and praiseworthy.",
    "On the occasion of this special day, let me also reminisce the historical event of signing of the Declaration of Independence of Maldives in Sri Lanka, and extend my sincere appreciation to the President of Sri Lanka, His Excellency Gotabaya Rajapaksa, the Prime Minister of Sri Lanka, Hon. Mahinda Rajapaksa and Foreign Minister of Sri Lanka, Hon. Dinesh Gunawardena for their unwavering support and cooperation in upholding the strong diplomatic bonds mutually shared by our countries, for centuries.",
    "I look forward to working together for unity and fraternity in an inclusive society where both our countries benefit mutually. Let us all adhere to the guidelines and safety measures proposed by the government and ensure safety and happiness to all, as we continue to revive back post Covid-19."
  ]
}