{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/hard-talk/GOVT-HAS-FAILED-IN-FISCAL-CONSOLIDATION-ERAN/334-216876",
  "ut": 1627268580,
  "time_id": "2021-07-26-0303",
  "title": "GOVT HAS FAILED IN FISCAL CONSOLIDATION - ERAN",
  "paragraphs": [
    "Faults Govt for pre-pandemic tax reduction",
    "Says the pandemic aggravated the economic crisis",
    "SJB for fully implementation of 13A with land and police powers",
    "Samagi Jana Balawegaya (SJB) MP Eran Wickramaratne, in an interview with the Daily Mirror, responds to questions both on the economic condition of the country and new political developments in the opposition. Excerpts:",
    "Q: Fuel prices are beyond the control of the local authorities alone to a great extent. Then, why did you bring an unsuccessful no faith motion targeting the subject minister only?",
    "It is nothing against the minister personally. It was propelled by the General Secretary of Sri Lanka Podujana Peramuna (SLPP), who also targeted the minister. We had to hold someone responsible. Again, it is the government’s policy to increase the prices this time.",
    "Q: But, the fuel prices are beyond the control of any government because any local prices are subject to fluctuations in the world market. What is your view?",
    "You are absolutely right. When it comes to fuel prices, there are four components in it. The international price of a barrel of crude oil is one of them. We normally use rates calculated by Singapore Platts. In the first variable, it has this rate. Then, we have the evaporation cost. The third component is exchange rate. Afterwards, we have refinery cost along with dealer cost, transport cost and storage cost involved. We also have management cost and taxation that affect pricing. What we cannot control is international price of fuel. It accounts for 55 to 60% of prices locally. Besides, taxation accounts for 35% of local price. When you add the two, you have less than 10% remaining.",
    "It is legitimate to tax whatever government that is in power there. There is public transport and private transport systems. People who use private transports should get taxed more because it involves environmental cost and use of roads.",
    "The good thing about having a fuel price formula is that it ensures transparency, reduces wastage, and exposes corruption. The processing cost and management costs are in our control though it is less than 10%. If fuel prices drop in the international market, there must be benefits for consumers definitely. The logic has to work both ways.",
    "In 2019, the average cost of fuel was US$ 63 a barrel. In 2020, because of the pandemic, the international price came down.",
    "Sri Lanka purchased fuel at US$ 19.56 a barrel, the lowest point in April, 2020. If you had basically applied the fuel price formula, the price of Octane 92 would have come down by Rs. 20 a litre. If you waited till the lowest point, it should have come to Rs. 77 a litre. When we purchased at US$ 90.56 a barrel, the fuel price remained zero in some countries. Fuel is something we don’t manufacture. We should get our consumers used to the fact that it is imported. Then, he gets a sense of price fluctuations. Then, he is free to decide on the use of fuel. When the price is low, he can decide whether to go on a picnic or pilgrimage using his vehicle. Even in India, if you go to a filling station, you find the prices revised on a daily basis at least by cents. It is not a new concept. We should have proceeded with this concept. We, in our time, did it once a month. Actually, we should have done it daily.",
    "Q: What is the reason for you to oppose price revision done at this juncture in keeping with spikes in the world market?",
    "I demonstrated that the government had not really passed on the benefit to consumers. If you had followed the pricing formula, they could have passed on the benefit from September, 2019 to March, 2020. In March, 2020, the international price crossed US$ 63 a barrel. It came to US$ 70 in June, 2020. Then, it would have warranted a price hike by a few rupees only.",
    "Q: We find a lot of criticism by the opposition against the present economic crisis. The government blame the crisis on the pandemic. What is your view?",
    "I look at two things - government’s policies and the pandemic. I fault the government for pre-pandemic policies. When we took over, we decided to tackle macro economy - to reduce the budget deficit from seven percent to 3.5%. When we left office, we reached 5.5 %. We did it by increasing revenue. Sri Lanka’s revenue, as a percentage of the Gross Domestic Product (GDP), was 11% when we took office. We revised the whole tax structure. We introduced a new Inland Revenue Bill. When we left office, Sri Lanka’s revenue had increased to 13 plus as a percentage of the GDP. The gap was coming down. The present rulers campaigned by saying that they would do away with these taxes. This government is not scientific in their approach of managing the economy, for that matter, managing anything. Then, revenue immediately crashes. In 2020, the government’s revenue crashed by one-third. Probably, the government’s revenue is 9% of the GDP. It is a policy issue. I am in complete agreement that the pandemic aggravated it. The pandemic has aggravated the situation all over the world. But, you absolutely need to have right policies. If you don’t have right policies, this is going to be even worse. This is one fundamental problem. They have moved away from fiscal consolidation.",
    "My view is that we should have fiscal consolidation with the support of the International Monetary Fund (IMF) or not. It is like the economy at home. You have to manage your economy. You have expenditure. You can take some debts. But, if you live off debt, there is no point blaming the bank for your bankruptcy. The government has really failed in fiscal consolidation.",
    "Q: But, the government says taxes were reduced for the benefit of the small, medium entrepreneurs. The argument is that it will serve as a stimulus for further investments by them. Then, the tax base will widen leading to a rise in revenue. What is your response?",
    "It is a fallacious argument. Our saving rates are very low. It is somewhere between 10-18% of the GDP. In India, it is more like 30%. Some time back, it was 50% in China. If you are going to generate economic growth, you turn your savings into investments.",
    "Compared with other countries in South Asia, we live beyond our means. That is why our savings are low but living standards higher. The saying ‘clean suit empty pocket’, can be applied to Sri Lankans. If you want to generate the economic growth, then, you have to get foreign savings. That is foreign investments. If you want to generate foreign savings, you have to create the necessary environment for it. When you do it, foreign investors look for certain basic things. One is the country risk. That is to see whether Sri Lanka honours its agreements, and has the rule of law, media freedom on social media etc. They look at the arrest of parliamentarian like Rishad Bathiudeen. The country risk is sociopolitical. Then, they look at the budget deficit, debt component etc. I read that Sri Lanka’s interest payment- 70% of revenue – is the highest in the world according to Moody’s grade ratings. I did a little bit of research and found that there was another country higher than Sri Lanka in this regard. Out of the rated countries, Sri Lanka is the highest. If we proceed with low savings, investment gap will be filled by foreign savings. For that, we need to create the environment. In doing so, the budget deficit is critical. Fiscal discipline is also absolutely critical. We have to get out of this myth.",
    "Q: When you say myth, what does it mean?",
    "The myth is that we are overtaxed. Look at the countries’ revenue as a percentage of the GDP! If you can find countries with lower revenue than Sri Lanka, I am asking for naming them. We have been used to a very low tax environment.",
    "Q: What is your tax policy being a member of the SJB (Samagi Jana Balawegaya)?",
    "We are very clear that taxes have a lot of things to achieve. One is the government’s revenue. For every 30 years in this country, there has been an armed uprising. When an armed uprising comes up, everybody is affected including businesses. People need to open their eyes. We have to avoid it. We don’t want people on the streets.",
    "If revenue falls below a point, there is no point in having a conversation. If people get out on the streets, there can be repercussions. Taxation has to be fair. It should be applied to everybody in the same way. For decades, the Ministers had discretion for tax exemptions. In the Inland Revenue Bill, championed by then Finance Minister Mangala Samaraweera and me as his State Minister, decided that it should be policy driven only. Any alteration should be approved by Parliament. In Sri Lanka, 80% tax revenue is from indirect taxes. Direct taxation should be at least 40%. Currently, it is only 20%. It is a reasonable goal.",
    "Today, if you look at SriLankan Airlines, its total accumulated loss is Rs.380 billion. The total budget we approve for education in 2021 is Rs.175 billion.",
    "Q: Such losses of the state institutions are a burden for any government. What do you propose to overcome the challenge?",
    "In 2019, I was the minister in charge of the subject. I said in Parliament that I would give SriLankan Airlines for anybody for one dollar. I am telling what is good for the country. I said this recently at a COPE (Committee on Public Enterprises) meeting. One JVP colleague said to me, \"you should offer it to somebody with Rs.380 billion,’.",
    "Q: For any country, it cannot dispense with its national airline. We have to work out some arrangement to run it. What is your view?",
    "Are we going to loss that money-Rs. 84 million a day and keep our children uneducated? We are not arguing for ourselves. We are arguing for the country. There is no use of false pride. What is my pride? My pride is that my two children are educated. Still, only 30,000-40,000 children get university education annually. Most children don’t get professional education. Instead of highways, we should be spending for high-speed internet highways. We should be giving children iPads and Tabs. That is where we should be spending. We have to invest more in human resources, not in physical infrastructure. We have to have this policy shift. That is where the real advantage is.",
    "Q: Is this your policy or that of your party?",
    "The policies that I speak about are completely backed by SJB. I also look after research and policy work of the party. We are committed to actually speaking the truth. Education and human resource development will get a very important place.",
    "Q: What will you do for SriLankan Airlines if you get back to power?",
    "In 2019, we offered SriLankan Airlines. We will still do the same. COPE is sitting on SriLankan Airlines at the moment. If anybody has a solution to SriLankan Airlines, we are ready to listen to him. The best possible scenario would have been the deal with Emirates during the time of former President Chandrika Bandaranaike Kumaratunga. Then, at least, you had the brand flying without a cost to the taxpayer. We must have a true sense of pride.",
    "For another example, the Ceylon Petroleum Corporation (CPC) has US$ 1.3 billion unpaid bills. They have US$ 2 billion owing to the banks. Unless the CPC pays, the banks will be in danger. If the banks are in danger, depositors are at risk. It is all entwined. We should diversify more into the manufacturing sector. We should put a huge emphasis on exports.",
    "Q: To digress a bit from economic matters, I would like to ask you about the recent political developments as far as the opposition is concerned. Former Speaker Karu Jayasuriya called for an allparty meeting. Is this the platform being formed in view of the 2024 presidential elections?",
    "The presidential election is still a long way off. The country’s situation is so bad. Therefore, the opposition should get together. We need to talk to each other and find common ground on common issues. That is a very good development. We are more concerned about the current situation.",
    "Q: Tamil National Alliance (TNA) MP M.A. Sumanthiran raised some concerns and asked for the opposition to spell out its stand on the Tamil national question in clear cut terms. What is your view on his remarks?",
    "What he said has truth in it. Every government has fallen short of meeting the aspirations of the Tamil speaking people. I agree with him. We, the SJB, are for full implementation of the 13th Amendment. We are public about it.",
    "Q: Including land and police powers?",
    "Yes, including everything there. President Gotabaya Rajapaksa came to power with the promise to bring about a new constitution. But, he did not turn Parliament into a constitutional assembly. We should all get together and relook at the concurrent list. That discussion has not happened yet. My personal view is that the concurrent list should be done away with.",
    "Q: The powers outlined in it should be vested with the centre or the provincial councils?",
    "It should be vested with the centre or the periphery after discussion on each subject."
  ]
}