{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/headline/WATCH-Karunaratne-loses-to-Nguyen-Dharmawardena-swept-in-29-seconds/419-216892",
  "ut": 1627330500,
  "time_id": "2021-07-26-2015",
  "title": "WATCH: Karunaratne loses to Nguyen, Dharmawardena swept in 29 seconds",
  "paragraphs": [
    "By Shehan Daniel reporting from Tokyo, Japan",
    "Sri Lanka badminton star Niluka Karunaratne suffered a second defeat at Tokyo 2020, losingto Ireland’s Nhat Nguyen 21-16, 21-14 at the Musoshino Park Sports Plaza today.",
    "Karunaratne conceded a two-point lead at the start of the first set, and couldn’t draw level, squandering three opportunities to do so in the first set alone, as the Irishman repeatedly exploited the Sri Lankans mistakes.",
    "Nguyen jumped to a 5-1 lead in the first set, but three straight points from Karunaratne gave the Sri Lankan a chance to tie the set.",
    "Karunaratne had another chance to put his opponent under pressure at 8-9, but the Irishman pulled away to a 12-9 lead.",
    "The Sri Lanka won two more points to have another crack at levelling with Nguyen, but he squandered the effort, hitting it wide, and never got as close again losing the first set 21-16.",
    "Karunaratne held his own early in the second set, a point within Nguyen at 2-3, but again so the chance slip away as the Irishman consolidated his lead to 15-6.",
    "From there, despite taking points from Nguyen, couldn’t get close, with three point rally at 11-20 proving a false dawn.",
    "Karunaratne, who lost the first match of his Group Play to Tzu-Wei Wang of Chinese Taipei 21-12, 21-15 last Saturday, will now finish as the bottom player of the group.",
    "Chamara Dharmawardena’s Tokyo 2020 campaign lasted just 29 seconds, defeated by Aden-Alexandre Houssein of Djibouti in the Men’s Judo -73kg event at the Nippon Budokon today.",
    "There was hope that the second-time Olympian could replicate the performance that saw him qualify for the Round of 16 at Rio in 2016, but the encounter was over even before he could settle in.",
    "Dharmawardena spent the first ten seconds of the duel cautiously looking for an opening, with his opponent reaching out and attempting to get a hold of him.",
    "When Dharmawadena finally did reach out to grapple his opponent, Houssein was prepared, leaving the Sri Lankan clutching at his sleeves.",
    "As the pair began to grapple, Houssein attempted a legsweep which Dharmawardena was prepared for, but it was the second more powerful attempt that completed the job on the Sri Lanka.",
    "With Dharmawardena swept onto his back, with referee Veli-Matti Karinkanta calling Ippon in favour of Houssein.",
    "Swimmer Matthew Abeysinghe will be the only Sri Lankan in competition tomorrow, as he swims in the fourth heat of the Men’s 100m Freestyle event at 3:39 p.m."
  ]
}