{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/More-tea-plucked-during-pandemic-Chairman-TSDA/108-216948",
  "ut": 1627354860,
  "time_id": "2021-07-27-0301",
  "title": "More tea plucked during pandemic: Chairman TSDA",
  "paragraphs": [
    "The COVID-19 pandemic has been a blessing in disguise for the tea industry, two officials attached to the plantation sector said yesterday.",
    "Chairman Tea Smallholders Development Authority (TSDA) Dr. Thushara Priyadharshana said the pandemic is a blessing in disguise as the production has increased by 20 per cent because people are more and more involved plucking due to free time during lockdowns. .\"We are expecting the total production of tea to exceed 300 million Kg by end of this year compared to 284 million Kg in 2020, Dr, Priyadharshana said.",
    "\"We have seen an increase in tea production as more people have gone into plucking during the pandemic period. More people have gone into town areas to engage in other jobs though there was work available, especially in small tea estates. Some who own about one acre of tea also were engaged in other ventures before the pandemic. However many went into tea plucking in rural areas during the pandemic and that made the plucking efficient because of the availability of labour. This, in turn, resulted in a 20 per cent increase in production during the pandemic period up to July this year,\" he said. Asked about the anticipated production drop with the transition towards organic fertilizer, Dr Priyadharshana said there is only speculation about the organic fertilizer. \"No one has proved that the production has gone down as a result of organic fertilizer,\" he said.",
    "Elaborating on the future of tea, Tea Small Holders Development Authority General Manager Dhammika G. Mahipala said there are plans to intercrop tea with coconut plantations in the Kegalle and Gampaha border where there is a suitable temperature for tea plantation. \"Temperature could be made suitable by providing a shade for tea plants by planting trees such as Giriseria plants,\" he said,",
    "Meanwhile, Tea Small Holders Development Authority has embarked on a project to develop tea tourism. This according to Mr. Mahipala consists of converting a building owned by the Tea Small Holders Authority within the Galle Fort into a tourists centre.\"we will be having a museum and a tea sales Centre in this location. We have invested around Rs 50 million for this. The second project is the renovation of the Bungalow in Hantana and Tea smallholders training centre into a holiday home. We have already begun the renovation of this bungalow and the training centre,\" he said. (YOHAN PERERA)"
  ]
}