{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/Death-of-girl-Police-say-independent-probe-underway-with-no-interference-from-any-party/108-216816",
  "ut": 1627251840,
  "time_id": "2021-07-25-2224",
  "title": "Death of girl: Police say independent probe underway with no interference from any party",
  "paragraphs": [
    "The Sri Lanka Police is conducting an independent investigation into the death of the 16-year-old domestic aide who worked at former Minister Rishad Bathiudeen’s residence, without any interference from any person.",
    "The Police said all the facts are being produced in the Court impartially and regularly to bring all the culprits to justice.",
    "Also, on the instructions of the Attorney General, several officers including a Deputy Solicitor General appear in court on behalf of the complainants and giving advice to carry out the investigations properly.",
    "Police said that further investigations are being carried out under the supervision of Senior DIG in charge of the Western Province Deshabandu Tennakoon and Senior DIG in charge of Crimes and Traffic Ajith Rohana on the instructions of the IGP.",
    "Meanwhile, responding to claims that police did not record statements from the girl while she was being treated at the hospital, police said though the investigation began soon after the incident, statements could not be recorded due to poor health of the victim.",
    "However, all the officers who went to obtain statements have recorded the reasons in writing.",
    "At least 35 statements have been recorded over the death as of now and the investigation team is in the process of recording further statements.",
    "Police said that they are conducting investigations from all angles with the necessary scientific and technical assistance in this regard and the aim is to uncover all the scientific evidence against the crime.",
    "The police arrested the wife, father-in-law and the person who had brought the girl to the house in connection the death while the brother-in-law of former minister was arrested in connection with another allegation of sexual abuse that took place in this house earlier.",
    "They were detained for 72 hours for further questioning and to be produced in the court on Monday (26).(Darshana Sanjeewa Balasuriya)"
  ]
}