{
  "url_hash": "5cc7804a",
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/dbs-jeyaraj-column/Medamulana-Dynasty-Four-Sons-and-Three-Grandsons-of-Don-Alvin-Rajapaksa/192-216335",
  "ut": 1626487260,
  "time_id": "2021-07-17-0201",
  "title": "“Medamulana Dynasty”:  Four Sons and Three Grandsons of Don Alvin Rajapaksa",
  "paragraphs": [
    "Unlike many of his descendants D.A. Rajapaksa had no burning ambition for ministerial posts or enormous greed for political power. DA Rajapaksa was of that rare breed of simple politicians who did not lust after perks, posts and power",
    "It was D.M. Rajapaksa who first started the practice of wearing a kurakkan-coloured shawl to symbolize Giruwapattuwa. This was followed by his brother and later his sons. The ‘sataka’ worn by the Rajapaksas of today is not merely due to notions of sartorial elegance. The practice has deeper meaningful roots",
    "Don Alvin Rajapaksa married Dona Dandina Samarasinghe Dissanayake of Palatuwa, Matara. They had nine children – six boys and three girls. Their names are Chamal, Jayanthi, Mahinda, Tudor, Gotabaya, Basil, Dudley, Preethi and Gandani",
    "However a third political family that came into its own in the 21st century has de-throned one dynasty and threatens to send the other dynasty into virtual extinction. This of course is the \"Medamulana Dynasty\" comprising the family members of D.A. Rajapaksa. The Medamulna political dynasty of Don Alvin Rajapaksa has come to stay in Sri Lankan politics",
    "Basil Rohana Rajapaksa was sworn in as Finance minister in the Government of Sri Lanka by his brother President Gotabaya Rajapaksa on July 8, 2021. The appointment was hailed by Basil’s supporters who project the new Finance minister as the \"saviour\" who would liberate Sri Lanka from the economic morass into which the country is sinking. It is being said that the less dogmatic, more pragmatic Basil with the reputation of being \"the man who gets things done\" is the right choice to helm financial affairs at this point of time. The anti- Rajapaksa camp \"Pooh-poohs\" this claim saying Basil is only a visible symptom of the prevailing crisis and not the solution. They also point out that Sri Lanka is fast becoming a \"failed state\" and that Basil’s appointment as a remedy to the malady, demonstrates the failure of his brother the President to deliver.",
    "If these were the two broad contrasting positions on the appointment of the new Finance minister in politically polarized Sri Lanka , Basil’s elevation evoked a somewhat amusing global response in sections of the world’s influential media. It was seen as an illustrative example of a single family enjoying a monopoly of political power in a democratic country. \"In Sri Lanka , the Government Looks Increasingly like a Family Firm\" was the heading of the article in the prestigious \"New York Times\". by its South Asia Correspondent Mushib Mashal An article in the much-respected \"The Hindu\" by its Colombo Correspondent Meera Srinivsan had the heading \"The Rajapaksas | Four brothers in one government\".",
    "It is somewhat understandable that the Rajapaksa family dominance in Sri Lanka n politics is being viewed as a bizarre phenomenon from a Western perspective. In India there are many instances of politics being a family business or for that matter in South Asia too. However what is rare in these countries is the extent to which a single family dominates the upper echelons of Government as in Sri Lanka . What is \"unique\" about this is that Sri Lanka is a democratic country with lawfully elected Governments.",
    "It is quite common for members of a single or extended family to dominate Governments in many Kingdoms in the middle-east or Brunei. The practice also prevailed in some African and Latin American dictatorships. What is different is that Sri Lanka has a vibrant democracy despite flaws. Yet one family has pervasive control over Government in Sri Lanka. It is estimated that 75% of the total budgetary allocations to ministries are to those under the purview of the Rajapaksa family.",
    "Currently there are four Rajapaksa brothers from one generation holding the reins in Government as President, Prime Minister and as cabinet ministers. President Gotabaya Rajapaksa is also the Minister of Defence. Prime Minister Mahinda Rajapaksa is Minister of Economic Policies and Plan Implementation, Minister of Buddhasasana, Religious & Cultural Affairs and Minister of Urban Development and Housing. Basil Rajapaksa is the new Finance Minister. Eldest brother Chamal Rajapaksa is Cabinet Minister of Irrigation. He is also the State Minister of National Security and Disaster Management and State Minister of Home Affairs.",
    "Then there is the younger generation in the Rajapaksa family. Mahinda’s son Namal Rajapaksa is the Minister of Youth Affairs and Sports and State Minister of Digital Technology and Enterprise Development. Chamal’s son Shasheendra Rajapaksa who was earlier the Chief Minister of Uva Province is currently a state minister with an \"extensive\" portfolio. He is the Minister of State for Organic Fertilizer Production, Supply and Regulation and Paddy and Grains, Organic Food, Vegetables, Fruits, Chillies, Onion and Potato Cultivation Promotion, Seed Production and Advanced Technology for Agriculture. In addition to Namal and Shasheendra, another cousin Nipuna Ranawaka is also an elected MP. He is the son of the youngest Rajapaksa daughter Gandani Ranawaka.",
    "Seven Members Thus we have seven members of the \"Medamulana Patriarch\" Don Alvin Rajapaksa (DA Rajapaksa) family ruling the political roost in a big way in contemporary Sri Lanka. Of his sons, Gotabaya is the executive President. Mahinda was formerly President and currently Prime Minister. Chamal and Basil are cabinet ministers. Of his grandsons, Namal is Cabinet minister and Shasheendra a state minister. Another grandson Nipuna is an MP. Given the fact that DA Rajapaksa himself was a State Councilor and Parliament Member for nearly two decades and held the posts of Deputy Minister, Minister, Deputy Chairman and deputy speaker in those years, it may appear that the acorns have not fallen far from the tree.",
    "However it must be emphasized that there was a crucial difference between D.A. Rajapaksa and his progeny. Unlike many of his descendants D.A. Rajapaksa had no burning ambition for ministerial posts or enormous greed for political power. DA Rajapaksa was of that rare breed of simple politicians who did not lust after perks, posts and power. It is indeed very hard to believe that an unambitious character like DA Rajapaksa strode across the Sri Lankan political stage successfully in the past. It is even more unbelievable when contrasted with the prevailing reality of political power being concentrated in the hands of Don Alvin Rajapaksa’s sons and grandsons.",
    "It is against this backdrop; therefore that this column focuses this week on the story of DA Rajapaksa in particular and the Rajapaksa clan of Medamulana in general.It is a tale told before but is worth relating here again. I have written about the rise of the Ruhunu Rajapaksas in the past and will be relying on those writings for this article. Much of the first-hand information I gathered about the Rajapaksas many years ago was from two persons who are no more today. One is Lawyer-writer and former MP Buddhika Kurukularatne who passed away last month. Apart from telling me what he knew, Buddhika was kind enough to go the extra mile by talking to some members of the Rajapaksa family to get more details. The other was former Secretary-General of Parliament and Ex-Ombudsman Sam Wijesinghe who breathed his last in 2014. Sam Wijesinghe hailing from the Deep South was related to the Rajapaksas and referred to DA Rajapaksa as his Uncle.",
    "The rise of the Rajapaksas as a formidable political family in the Ruhunu began with Don David Vidanarachchi Rajapaksa, the father of DA Rajapaksa and grandfather of Mahinda and siblings and the great grandfather of their offspring. Don David Rajapaksa hailed from Buddhiyagama in Weeraketiya in the Southern Hambantota District. The ancient Ruhunu kingdom of the Sinhala kings consisted of what are today the Administrative Districts of Galle, Matara, Hambantota and Moneragala. Don David or D.D. Rajapaksa was the hereditary Vidane Arachchi or village headman of a cluster of villages and hamlets known as ‘IhalaValikada Korale’.",
    "‘Kurakkan Country’ The semi-feudal practice of village headman adopted by the British has now been replaced by the Grama Niladari system. The Grama Niladaris of today are toothless Government employees whereas the Vidane Arachi of colonial vintage was a potty despot of his area of authority. The area inhabited by the Rajapaksa family was the division known as Giruweva/Giruwapattuwa. It was an agricultural region where the growing of crops and vegetables, coconut cultivation and buffalo/cattle rearing were the basis of the local economy. ‘Slash and burn’ chena cultivation was a fact of life. Cultivation of kurakkan or millet was widely prevalent and the region was regarded generally as ‘Kurakkan Country’.",
    "D.D. Rajapaksa had three sons and a daughter. The eldest was Don Coronelis Rajapaksa or D.C. Rajapaksa, who served as coroner of the area. The second son was Don Mathew Rajapaksa while the youngest son was Don Alvin Rajapaksa. The direct entry into electoral politics was made by Don Mathew Rajapaksa or D.M. Rajapaksa who was elected State Councilor during British times. He was succeeded as State Councilor by younger brother Don Alvin Rajapaksa or D.A. Rajapaksa, who later became a Member of Parliament after Independence.",
    "The Giruwapattuwa Rajapaksas are an old and respected Southern Province Govigama family. They have deep Buddhist roots and were wedded to the land. Unlike some other eminent Sinhala families who obtained posts and perks from the colonial masters, the Rajapaksas of Giruwapattuwa remained resolutely independent.",
    "The finest example of that sturdy independence and anti-colonial spirit was D.M. Rajapaksa, known popularly as the ‘Lion of Ruhunu’. When universal suffrage was introduced and elections to the State Council were held in 1931, D.M. Rajapaksa supported V.S. Wickramanayake in the Hambantota Constituency. Wickramanayake was elected. In 1936, D.M. Rajapaksa himself plunged directly into politics and faced hustings. In those days candidates used different colours for their respective ballot boxes. D.M. chose brown, the colour of kurakkan, to symbolize ‘Kurakkan Country’. He won with a majority of 12,097 votes.",
    "Don Mathew Rajapaksa Don Mathew Rajapaksa was a man of the people. He gave voice to the oppressed and stood up for the underprivileged. He did much for the emancipation of the Rodiya community. It was D.M. Rajapaksa who first started the practice of wearing a kurakkan-coloured shawl to symbolize Giruwapattuwa. This was followed by his brother and later his sons. The ‘sataka’ worn by the Rajapaksas of today is not merely due to notions of sartorial elegance. The practice has deeper meaningful roots.",
    "Unfortunately D.M. Rajapaksa died at the age of 49 in 1945. His eldest son Lakshman had not even reached the voting age of 21 then. The mantle therefore fell on his unassuming younger brother Don Alvin Rajapaksa who was born on November 6, 1905. Their father D.D. Rajapaksa had died in 1912. While D.M. Rajapaksa had taken to social service and politics, his brother D.A. Rajapaksa had tended to look after the family occupation of farming and livestock breeding. The elder brother lived at the Mahagedara in Kondagala and the younger at the Medamulana Mahagedara.",
    "Don Alvin Rajapaksa married Dona Dandina Samarasinghe Dissanayake of Palatuwa, Matara. They had nine children – six boys and three girls. Their names are Chamal, Jayanthi , Mahinda, Tudor, Gotabaya, Basil, Dudley, Preethi, and Gandani.",
    "After D.M. Rajapaksa’s demise the people of Giruwapattuwa wanted D.A. Rajapaksa to step into his brother’s shoes. D.M. Rajapaksa’s sons Lakshman and George were too young then. The simple D.A. content with his agriculture, refused. Finally a deputation of notables went in procession to the paddy field where D.A. was engaged in ploughing. The delegation had with them the nomination papers and pressed D.A. to replace his brother in the State Council.",
    "Don Alvin Rajapaksa Finally Don Alvin Rajapaksa agreed. He washed the mud off his hands and legs and signed the nomination papers, whereupon one person removed his shawl and wrapped it around D.A. in a symbolic gesture. The kurakkan sataka tradition continued. He was elected unopposed to the State Council representing the Hambantota constituency on July 14, 1945.",
    "D.A. Rajapaksa was an old student of Richmond College, Galle and was well-versed in English. He captained the Soccer Team and was Vice Captain of the Cricket Team. It is said that the ground record he set up in the match with Prince of Wales College, Moratuwa, still stands. Yet he had no qualms about becoming a full-fledged agriculturist. When he entered the State Council and took his oaths on August 8, 1945, he became a member of the Executive Committee on Agriculture and Lands.",
    "D.A. Rajapaksa represented the Beliatta seat in Parliament from 1947 to 1965 with a short break in March 1960, when he lost to D.P. Atapattu of the UNP. D.A. lost in 1965 to D.P. Attapattu again. D.A. Rajapaksa won Beliatta on the UNP ticket in 1947 and thereafter on the SLFP ticket till ’65.",
    "Don Alvin Rajapaksa was a faithful deputy to S.W.R.D. Bandaranaike, who crossed over from the UNP to SLFP on July 12, 1951. When SWRD crossed over, five others (A.P. Jayasooriya, George R. de Silva, Jayaweera Kuruppu, D.S. Goonesekera and D.A. Rajapaksa) were supposed to follow suit, but when the moment came, only D.A. Rajapaksa crossed the floor behind Bandaranaike like his shadow. The others got cold feet to cross over in the House but did so later. On September 2, 1951, the SLFP was formed. D.A. was one of the 44 signatories giving notice of the formation of the SLFP. In the 1952 May elections, the fledgling SLFP won nine seats. D.A. Rajapaksa was one of the nine victors.",
    "D.A. Rajapaksa’s Characteristics In spite of these impressive credentials and loyalty, D.A. Rajapaksa was not a cabinet minister in the 1956 Cabinet or 1960 July Cabinet. Initially I thought that D.A. Rajapaksa had been deprived of his rightful due in the SLFP despite his loyalty. But I learnt later from Sam Wijesinghe and Buddhika Kurukularatne that this was due to his lack of ambition, love of his roots and abhorrence for the trappings of power. As stated earlier these characteristics of D.A. Rajapaksa contrast sharply with the conduct of some of his descendants ensconced in the corridors of power. In 1956, S.W.R.D. offered D.A. any Cabinet post, other than the one to be given to C.P. de Silva, but D.A. declined firmly and only wanted nephew Lakshman (DM Rjapaksa’s son) to be given a deputy minister’s post, so Lakshman was made Deputy to Trade and Commerce Minister R.G. Senanayake. But the people of Hambantota under the leadership of Tangalle lawyer Wickramasuriya protested strongly to S.W.R.D. and D.A. So a reluctant Don Alvin Rajapaksa was forced to be Deputy Minister of Land, Irrigation and Agriculture under C.P. de Silva.",
    "During Dr. Wijayananda Dahanayake’s short-lived Cabinet after S.W.R.D. Bandaranaike’s assassination on September 26, 1959, D.A. Rajapaksa was Minister of Agriculture and Lands. He resigned in two weeks on October 10 to pre-empt dismissal by the eccentric Dahanayake who was sacking his ministers en masse and appointing fresh ministers.",
    "In July 1960, Sirimavo Bandaranaike became Premier and offered a Cabinet portfolio to D.A. Rajapaksa, who declined it. Then she offered him the office of speaker. This too was refused. It is said that Rajapaksa said that he preferred his home in Medamulana to \"Mumtaz Mahal\". He continued to remain in a room at \"Srawasthi\" when in Colombo. On November 6, 1962, upon the death of Deputy Chairman of Committees Wariyapola MP A.M.A. Adhikari, D.A. Rajapaksa was appointed to fill the vacancy. When the Speaker R.S. Pelpola resigned on January 24, 1964 to accept a ministerial portfolio, the then Deputy Speaker Hugh Fernando became Speaker. D.A. Rajapaksa succeeded Hugh Fernando as the Deputy Speaker, which position he held until the defeat of the Sirimavo Bandaranaike Government in December 1964. D.A. Rajapaksa lost his seat in 1965 and passed away on November 7, 1967.",
    "Mahinda Rajapaksa Sri Lanka Freedom Party Leader Sirimavo Bandaranaike offered the post of party organizer for Beliatta to DA’s eldest son Chamal after D.A. died. Meanwhile Chamal Rajapaksa had joined the Police force as a Sub-Inspector. Chamal therefore declined and recommended his \"malli\" Mahinda instead. Initially Sirimavo was hesitant thinking Mahinda was too young and somewhat irresponsible. Later on she relented and appointed Mahinda as Beliatta SLFP Organizer in 1968.",
    "The 1970 elections saw the United Front sweeping the polls with the SLFP getting 91 seats and the LSSP and CP winning 19 and 6 seats respectively. Percy Mahendra Rajapaksa defeated his rival from the UNP, Dr. Ranjith K.P. Atapattu. Mahinda got 23,103 votes and Ranjith 16,477. In 1977, the roles were reversed with Ranjith Atapattu winning with 24,289 votes while Mahinda Rajapaksa got 17,896. Interestingly Mahinda’s father D.A. Rajapaksa and Ranjith’s father D.P. Atapattu had been rivals contesting Beliatta in each election from 1947. Sadly both fathers were not alive to see their sons become Beliatta MPs.",
    "In 1985 Mahinda’s elder brother Chamal Rajapaksa contested the Mulkirigala by election. Mahinda led the campaign for Chamal. There was a shooting incident and Mahinda was arrested and remanded for three months. Subsequently he was cleared by courts. It was during this time of imprisonment that the matriarch Mrs. D.A. Rajapaksa passed away and to Mahinda’s eternal sorrow he was not allowed to attend the funeral of his mother.",
    "Family Politics Family politics is now a familiar feature of Sri Lanka’s political landscape cutting across race, religion, caste and creed. A perusal of a list of Sri Lankan political families in alphabetical order starting from the Abdul Majeeds of the East and going down to the Yapa Abeywardenas of the South would reveal that ethnicity is no bar to political family bandyism in Sri Lanka.",
    "There are various types of political dynasties at different levels from the national, provincial, divisional and electoral level. There are also different degrees of pedigree and vintage in these dynasties. While there are many regional and sub-regional political families, there have been only three major family formations dominating politics at a national level so far in Sri Lanka.",
    "The first is the \"Bothale Dynasty\" of D. S. Senanayake, his son Dudley Senanayake and nephew Sir John Kotelawala along with extended family members J. R. Jayewardene and Ranil Wickremesinghe. The next is the \"Horagolla Dynasty\" of S.W.R.D. Bandaranaike, his wife Sirimavo Ratwatte Bandaranaike, Daughter Chandrika Bandaranaike Kumaratunga and son Anura Bandaranaike. Both the Bothale and Horagolla dynasties have been paramount in 20th century Sri Lankan politics since Independence.",
    "\"Medamulana Dynasty\" However a third political family that came into its own in the 21st century has de-throned one dynasty and threatens to send the other dynasty into virtual extinction. This of course is the \"Medamulana Dynasty\" comprising the family members of D.A. Rajapaksa. The Medamulna political dynasty of Don Alvin Rajapaksa has come to stay in Sri Lankan politics.",
    "D.B.S.Jeyaraj can be reached at dbsjeyaraj@yahoo.com"
  ]
}