{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/insight/What-you-need-to-know-about-global-Covid-19-developments-right-now/374-216115",
  "ut": 1626316680,
  "time_id": "2021-07-15-0238",
  "title": "What you need to know about  global Covid-19 developments right now",
  "paragraphs": [
    "The WHO’s Strategic Advisory Group of Experts on vaccines said in June the Pfizer Inc vaccine could be used as a second dose after an initial dose of AstraZeneca, if the latter is not available",
    "Since the outbreak of the disease in China in 2019, health authorities in over 200 countries reported an approximate 187.8 million Covid‑19 cases and 4 million deaths",
    "The World Health Organisation’s chief scientist has advised individuals against mixing and matching COVID-19 vaccines from different manufacturers, saying such decisions should be left to public health authorities",
    "Only a handful of countries or territories have been left with no active Covid-19 cases, as they managed to keep the deadly global pandemic at bay. From the United States to Italy and India, second or third waves of the illness have worsened conditions than when the pandemic initially hit in early 2020. In Sri Lanka where lock downs and travel restrictions have eased, its citizens are benefiting from an accelerated vaccination roll out by the government.",
    "Since the outbreak of the disease in China in 2019, health authorities in over 200 countries reported an approximate 187.8 million Covid‑19 cases and 4 million deaths. Countries across Asia, Americas and Africa are seeing a resurgence in COVID-19 cases, forcing them to bring back or extend stringent lock downs and hampering drives to vaccinate their population. Here’s a look at the latest global developments of the Coronavirus.",
    "WHO warns individuals against mixing and matching COVID vaccines The World Health Organisation’s chief scientist has advised individuals against mixing and matching COVID-19 vaccines from different manufacturers, saying such decisions should be left to public health authorities.",
    "\"It’s a little bit of a dangerous trend here,\" Soumya Swaminathan told an online briefing on Monday after a question about booster shots. \"It will be a chaotic situation in countries if citizens start deciding when and who will be taking a second, a third and a fourth dose.\" Swaminathan had called mixing a \"data-free zone\" but later clarified her remarks in an overnight tweet.",
    "Individuals should not decide for themselves, public health agencies can, based on available data,\" she said in the tweet. \"Data from mix and match studies of different vaccines are awaited - immunogenicity and safety both need to be evaluated",
    "\"Individuals should not decide for themselves, public health agencies can, based on available data,\" she said in the tweet. \"Data from mix and match studies of different vaccines are awaited - immunogenicity and safety both need to be evaluated.\" The WHO’s Strategic Advisory Group of Experts on vaccines said in June the Pfizer Inc vaccine could be used as a second dose after an initial dose of AstraZeneca, if the latter is not available.",
    "A clinical trial led by the University of Oxford in the UK is ongoing to investigate mixing the regimen of AstraZeneca and Pfizer vaccines. The trial was recently expanded to include the Moderna Inc and Novovax Inc vaccines. (Source: Reuters)"
  ]
}