{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/600-000-half-vaccinated-people-in-WP-now-vulnerable-to-Delta-variant/108-216946",
  "ut": 1627368660,
  "time_id": "2021-07-27-0651",
  "title": "600,000 half vaccinated people in WP now vulnerable to Delta variant",
  "paragraphs": [
    "The 600,000 people, above the age of 30 years, who received the first dose of Astrazeneca, but who have not received the second doses are vulnerable to the rapidly spreading Delta variant in the country, a leading health expert told Daily Mirror yesterday.",
    "Speaking on the grounds of anonymity, the expert, who is well briefed on the efficiency of the COVID-19 vaccines said those who await the second jabs of Astrazeneca were now under the vulnerable group as the immune response generated by the first dose had rapidly declined.",
    "However the expert said the immune response does not decline in everybody equally and the younger population who had received the first dose had a better response than the older population.",
    "\"However it is very important to get the second shot in on everyone who received the first doses, especially with the Delta variant,\" the official said.",
    "Countries such as the UK, which was initially maintaining a gap of 12 weeks between the two doses of Astrazeneca, shortened this gap to 8 weeks with the entry of the Delta variant. This is because as time goes by, with just one shot, one’s immune response meter goes down.",
    "In Sri Lanka it has been almost 20 weeks since the first doses were administered.",
    "An Oxford study has however shown that even though the second dose is administered late, it does not mean those who received the first shot have to start all over again. It will still work as a booster shot, but the most important thing is to get the second shot in with the Delta variant causing havoc, the expert said.",
    "\"Until you get it people are not protected, especially against the Delta variant. The UK brought forward the time to receive the second shot to induce protection faster. If not, these people become vulnerable too,\" the expert said.",
    "Sri Lanka is yet to receive a date as to when the expected over 1 million doses of Astrazeneca will arrive from Japan through the WHO’S Covax facility.",
    "Initially the government had announced that it would arrive by July 21, but over the weekend, State Minister Channa Jayasumana said there would be a further delay due to flight delays from the Olympics ongoing in Tokyo.",
    "The doses are expected to arrive this month.",
    "Sri Lanka initially administered Pfizer as the second dose but soon revised this decision after a confirmation that more Astrazeneca doses would be coming in.",
    "All 600,000 who await their second jabs are from the Western Province which is worst affected by the ongoing COVID-19 spreads. (JAMILA HUSAIN)"
  ]
}