{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/Antibodies-from-Sinovacs-COVID-19-shot-fade-after-about-6-months-booster-helps/108-216960",
  "ut": 1627403640,
  "time_id": "2021-07-27-1634",
  "title": "Antibodies from Sinovac’s COVID-19 shot fade after about 6 months, booster helps",
  "paragraphs": [
    "Antibodies triggered by Sinovac Biotech's (SVA.O) COVID-19 vaccine declined below a key threshold from around six months after a second dose for most recipients, although a third shot had a strong booster effect, according to a lab study.",
    "Chinese researchers reported the findings from a study of blood samples from healthy adults aged between 18-59 in a paper published on Sunday, which has not been peer reviewed.",
    "Among participants who received two doses, two or four weeks apart, only 16.9% and 35.2% respectively still had neutralising antibodies above what researchers regard as a detectable threshold level six months after the second shot, the paper said.",
    "Those readings were based on data from two cohorts involving more than 50 participants each, while the study gave third doses of the vaccine or placebo to a total of 540 participants.",
    "Researchers said it was unclear how the decrease in antibodies would affect the shot's effectiveness, since scientists have yet to figure out precisely the threshold of antibody levels for a vaccine to be able to prevent the disease.",
    "\"In the short-to-medium term, ensuring more people complete the current two-dose schedule of CoronaVac should be the priority,\" the paper said.",
    "Indonesia and Thailand have already agreed to give a third shot from Moderna and Pfizer respectively for some people who are fully vaccinated with the Sinovac vaccine, amid concerns over its effectiveness against the more transmissible Delta variant of the coronavirus.",
    "Turkey had started offering a third dose from either Sinovac or Pfizer to some people who have got Sinovac shots.",
    "As of end-June, Sinovac has delivered more than 1 billion doses of the vaccine, a major vaccination tool in China, Brazil, Indonesia and Chile.",
    "Philippines' Health Secretary Francisco Duque said on Tuesday there is no recommendation yet from the country's vaccine expert panel on giving a booster shot but experts are discussing the possibility.",
    "The study also said that participants in some cohorts who received a third dose of the Sinovac shot about six months after the second showed around a 3-5 fold increase in antibody levels after a further 28 days, compared with the levels seen four weeks after the second shot.",
    "Researchers cautioned the study did not test the antibodies' effect against more transmissible variants, and that further research was needed to assess antibody duration after a third shot.",
    "The study was conducted by researchers at disease control authorities in Jiangsu province, Sinovac, and other Chinese institutions. (Reuters)"
  ]
}