{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/cricket/England-take-early-T20I-series-lead-over-Sri-Lanka/315-214750",
  "ut": 1624533000,
  "time_id": "2021-06-24-1110",
  "title": "England take early T20I series lead over Sri Lanka",
  "paragraphs": [
    "A strong collective bowling performance and a damaging opening partnership helped England record an eight-wicket victory to draw first blood in their T20I home series against Sri Lanka.",
    "Despite the rearguard action of Sri Lankan number six Dasun Shanaka, his second T20I fifty was struck in vain as five of England’s six bowlers claimed wickets to set up a comfortable chase at Sophia Gardens.",
    "Jos Buttler capitalised on the bowlers' early work to make an unbeaten 68 off 55 deliveries, combining in a first wicket partnership of 80 with Jason Roy, who compiled 36 (22).",
    "Sri Lankan captain Kusal Perera won the toss and elected to bat on a surface that proved to be tricky, as Avishka Fernando scooped a Sam Curran delivery into the hands of Chris Jordan for a duck in the second over of proceedings. Jordan tasted bowling success of his own three overs later, as Danushka Gunathilaka, also troubled by the pace of the surface, miscued a scoop into the gloves of Buttler for 19 (16).",
    "Liam Livingstone was deployed before fellow leg-spinner Adil Rashid, and captain Eoin Morgan’s decision was vindicated when he claimed Kusal Mendis for nine, trapping him in front lbw with a full delivery that Mendis attempted to sweep. Mendis’ review was unsuccessful, and England pushed on with a fourth wicket as Dhananjaya de Silva picked out Rashid at third man for just three.",
    "Relishing in the home conditions, England were relentless with the ball and in the field, with only four boundaries conceded in the first ten overs. Reeling at 57/4 at the halfway mark, captain Perera looked to up the tempo, hitting Mark Wood for a six off the first ball of the eleventh over, albeit with the help of the top-edge of his bat.",
    "Shanaka was measured in the beginning of innings, scoring just 13 in his first 19 deliveries, before attempting to lift the rate with two consecutive boundaries behind point to begin the 15th over, also off Wood.",
    "England pressed on with their plans, and prevented Sri Lanka from scoring a boundary for the next 25 balls. Shanaka was able to break the shackles eventually, scoring 23 of his team’s 25 runs in the last two overs to reach his half-century, before falling to Curran off the last ball of the innings. Sri Lanka finished on 129/7, 21 runs short of the average first innings total at the venue for T20 Internationals, with the economical Chris Woakes (0/14 off three overs) the only English player without a wicket.",
    "England’s typical approach of all-out attack at the top of the innings was on full display in reply, with boundaries in every over of the Powerplay. After strolling to 61/0 after the six overs and 80/0 after eight, it took a leaping effort on the inner circle by Gunathilaka to break the partnership, after Roy mistimed his swat down the ground.",
    "Isuru Udana claimed Sri Lanka’s other wicket, sneaking one in between Dawid Malan’s bat and pad to dismiss him for 7 (14), though Buttler nursed home the chase with Jonny Bairstow (13 off 12 balls) to win the match with 17 balls to spare.",
    "England can claim the three-match series with another win on Thursday."
  ]
}