{
  "url_hash": "e5e21a3b",
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/CA-orders-to-demarcate-physical-boundaries-of-Muthurajawela-Sanctuary/108-216885",
  "ut": 1627310760,
  "time_id": "2021-07-26-1446",
  "title": "CA orders to demarcate physical boundaries of  Muthurajawela Sanctuary",
  "paragraphs": [
    "The Court of Appeal today issued an order directing the Surveyor General to expedite the demarcation of physical boundaries of Muthurajawela Sanctuary, to clarify the legal status.",
    "Court of Appeal two-judge-bench comprising Justice Sobhitha Rajakaruna and Justice Dhammika Ganepola made this order under writ petitions filed by Colombo Archbishop Malcolm Cardinal Ranjith and Centre for Environmental Justice.",
    "Additional Solicitor General Sumathi Dharmawardena, PC appearing for the Attorney General emphasised the necessity of having physically demarcated boundaries in respect of the Muthurajawela Sanctuary citing this would resolve most of the issues relating to the petitions. He said authorities are facing severe difficulties when discharging their duties owing to the non-demarcation of the boundaries in the Muthurajawela Sanctuary. He further submitted to the court that the proposed power plant site is located outside the southern boundaries of the Muthurajawela Sanctuary.",
    "Meanwhile, Mr Dharmawardena gave an undertaking that he will file a motion before the 6th of August with the Survey General's planning timeline into the demarcation process.",
    "President's Counsel Jayantha Weerasinghe appearing for the 19th respondent of the petition alleged that according to a report issued by Wildlife Department, a village consisting of several houses had been constructed under the supervision of Colombo Archbishop, within the Muthurajawela Sanctuary.",
    "He told the court that a person who comes before Court must come with a clean hand.",
    "Meanwhile, Counsel Ravindranath Dabare appearing for the Centre for Environmental Justice submitted to the court that waste is being dumped and the lands are being filed within the Muthurajawela Sanctuary regularly. In their petition, the Centre for Environmental Justice and its Executive Director Withanage Don Hemantha Ranjith Sisira Kumara named Central Environmental Authority, Minister of Environment, Minister of WildLife and Forest Conservation and nine others as respondents.",
    "The petitioners are seeking an interim order directing the respondents to stay any further dumping of waste and the filling of lands within the Muthurajawela Sanctuary."
  ]
}