{
  "url_hash": "8e250b34",
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business__main/Govt-to-bring-in-laws-to-make-18-years-minimum-age-of-employment/245-216984",
  "ut": 1627434420,
  "time_id": "2021-07-28-0107",
  "title": "Govt. to bring in laws to make 18 years minimum age of employment",
  "paragraphs": [
    "Labour Minister Nimal Siripala de Silva in discussion with officials representing ILO, Child Affairs Bureau, Attorney General’s Department, UNICEF, Justice Ministry and Labour Department",
    "The Labour Ministry has announced plans to bring in new laws and regulations and alter the existing laws within three months to prohibit anyone below 18 years of age being employed.",
    "The move follows the death of a 16-year-old domestic helper who was employed at a politician’s residence. Labour Minister Nimal Siripala de Silva yesterday revealed these plans during a discussion with officials from the International Labour Organisation (ILO), Bureau of Women and Child Affairs, Attorney General’s Department, United Nations Children’s Fund (UNICEF), the Ministry of Justice and the Labour Department. The government last year decided to amend the country’s labour laws, changing the minimum age of employment from 14 to 16 years.",
    "During the meeting, Minister de Silva informed that the last draft amending the regulations under the hazardous occupations regulations under the Employment of Women, Young Persons and Children’s Act (EWYPCA), has already been prepared by his Ministry.",
    "The EWYPCA regulates the work, working hours and conditions of children and young persons. It determines a list of hazardous forms of child labour, to protect children above the minimum age of employment, in fulfilling the State obligation under Article 3 (d) of ILO Convention 182, ratified in March 2001, through the regulations issued in 2010 under the Act.",
    "Further, he also revealed plans to amend laws and regulations in relation to the domestic housemaid service with the aim to further enhance legal protection and welfare of housemaids in the country.",
    "He stressed that if a household employs a housemaid, the details of the individual must be shared with the District Labour Official and the employers should comply with the national minimum wage. Further, he noted that the Labour Ministry would be working on amendments to key laws in order to ensure that the housemaids are included to benefit from the Employees’ Provident Fund and Employees’ Trust Fund. In addition, the Minister also discussed a range of key proposals to strengthen the legal framework in ensuring a healthy working environment as well as possible gratuity payments for domestic housemaids in the country."
  ]
}