{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/latest_news/100-MT-of-used-yoghurt-cups-discarded-annually-Amaraweera/342-216888",
  "ut": 1627320300,
  "time_id": "2021-07-26-1725",
  "title": "100 MT of used yoghurt cups discarded annually: Amaraweera",
  "paragraphs": [
    "Nearly 100 tons of used plastic yoghurt cups are discarded into the environment annually, Environment Minister Mahinda Amaraweera said.",
    "While having a discussion at the Ministry, he said, only seven percent of the used empty yoghurt cups are collected for recycling and the remaining 93% are either dumped into the environment or some are burnt and destroyed.",
    "It was also revealed that around 45 million yoghurt and similar plastic containers are getting accumulated in the environment every month.",
    "Minister Amaraweera stated that the use of plastic cups in the production of yoghurt can not be banned as no alternative has been suggested so far.",
    "\"Yoghurt is a highly nutritious food that can be bought at an affordable price, and if the plastic cups used for it are banned, the dairy industrialists will be hit hard and the industry may collapse as there is no other option,\" he said.",
    "Therefore, the use of plastic cups for yoghurt would not be prohibited, nevertheless, the use of plastic spoons that is supplied along with the yoghurt cups will be prohibited, he said.",
    "A Cabinet paper has already been submitted listing eight plastic products proposed to be banned. It includes plastic spoons that are used to eat yoghurt. According to the cabinet paper, it is proposed to ban plastic spoons, forks, plastic cups, food stirrers, etc. in the future.",
    "\"However, careless burning of yoghurt cups as well as all polythene and other plastic items is also harmful to the environment and human health. Absorption of polluted air has been found to increase the risk of lung cancer, skin diseases and respiratory disorders,\" he said.",
    "\"There are several companies in our country buy disposable yoghurt cups for recycling. Representatives of those recycling companies also pointed out that the public can therefore earn extra money without burning empty yoghurt cups or dumping them into the environment,\" Minister Amaraweera said.",
    "Therefore, it was proposed to initiate a mechanism to expand the size of these purchasing centres. Also said that steps would be taken to expand the consumer awareness programme in recycling used yoghurt cups by calling the representatives of those institutions once again in the future, the Minister added. (Chaturanga Samarawickrama)"
  ]
}