{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business-news/Tea-industry-to-face-double-whammy-amid-easing-volumes-and-prices/273-216836",
  "ut": 1627260480,
  "time_id": "2021-07-26-0048",
  "title": "Tea industry to face double whammy amid easing volumes and prices",
  "paragraphs": [
    "It will be an uphill task for the tea industry to maintain its export earnings with the potential decline in volumes caused by the chemical fertilizer ban and the prevailing low prices at the auctions, according to Fitch Ratings.",
    "While higher tea prices could offset any volume decline, the rating agency expressed scepticism of its possibility given the expanding gap between the prevailing low auction prices and the price that they estimate as required to make up for the loss of earnings caused by potential volume loss.",
    "Sri Lanka’s tea prices are under pressure amid normalising supplies from other tea producing nations after the pandemic disrupted their supply chains, last year.",
    "As a result, Fitch projected continuous downward pressure on prices, as buyers are in a strong position to negotiate prices down with gradual restoration of supplies from other tea producing nations.",
    "Adding to the woes is the potential decline in volumes from the ease in rains and the likely troubles in getting fertilizer on time after the government banned importation of chemical fertilizer from May 6.",
    "Fitch citing The Colombo Tea Traders Association said the local tea output could fall by as much as 40-50 percent if the ban continues.",
    "However, the government maintains that the country has already imported sufficient chemical fertilizer stocks, adequate for the next 12 months. Underscoring the dour expectations for volumes, Sri Lanka sold 6.8 million kilograms of tea at the most recent auctions held on July 19 and 20, down from 7.1 million kilograms a week earlier.",
    "There is an expectation for the volumes to further in the coming few weeks, although if it is going to be persistent is yet to be ascertained.",
    "\"Fitch believes tea plantations may find it challenging to offset the decline in yields via higher tea prices,\" the rating agency said.",
    "Mirror Business last week reported citing an ICRA Lanka report of possible fresh external sector challenges from the combination of falling export commodity prices such as tea and the rising industrial import prices such as oil and metal.",
    "Dollar denominated auction prices fetched at the tea auctions through May showed that the average price of tea at the Colombo auctions slipped to US $ 3.06 per kilogram in May 2021 from US $ 3.75 a year ago, down 18.4 percent. Prices have continued to fall in June.",
    "\"We estimate that tea prices of more than US$ 5 per kg will be required to offset the potential output fall resulting from the inability to use chemical fertilizer in the near term,\" Fitch Ratings said.",
    "However the highest price Ceylon Tea has fetched was US$ 4.30 a kilogram at the auctions in September 2017. Despite the forecasts for easing in volumes, production data available for the first five months showed that the tea volumes had increased by nearly 30 percent to 133.8 million from the same period in 2020.",
    "Meanwhile, the earnings from tea exports were recorded at US$ 526.6 million, up 15.3 percent from the same period in 2020.",
    "However, on a possible upside, Fitch Ratings expects tea prices to increase, \"if the ban on imported fertilizer remains in place for an extended period due to supply constraints as well as its new organic appeal\"."
  ]
}