{
  "url_hash": "5a2a577d",
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/expose/Govt-hand-surfaces-from-rice-mafia-saga/333-216484",
  "ut": 1626739260,
  "time_id": "2021-07-20-0001",
  "title": "Govt. hand surfaces from rice mafia saga",
  "paragraphs": [
    "Large-scale millers are increasing prices of rice by creating an artificial rice shortage",
    "Cabinet Spokesperson Minister Keheliya Rambukwella recently announced that 100,000 metric tons of rice was to be imported to control rice prices in the market. This was confirmed by Minister of Agriculture Mahindananda Aluthgamage. Minister Bandula Gunawardena said that tenders had been called for the import of rice.",
    "All Ceylon Farmers’ Federation (ACFF) National Coordinator Namal Karunaratne said that this situation has arisen due to the wrong policies of the Government. \"The rice mafia operates with the participation of few individuals and the claims about the inability to regulate the rice price are lies. The rice mafia is operated through an agreement and there is evidence to prove that. Importing 100,000 metric tons of rice is also a part of this mafia. The Government does not interfere when large scale millers purchase paddy at low prices. The regulation of paddy prices exists on paper and does not control the market price at all.\" he added.",
    "Minister Aluthgamage said that as soon as the announcement was made to import rice, the rice price was reduced by ten rupees. However Karunaratne is of the view that the paddy price did not drop because the Government announced its decision to import rice, but it happened because paddy harvesting has already commenced. \"The purpose of importing rice is to protect the large scale millers in the country. When the President assumed power the price of rice increased by five rupees per kilo. The rice price which was at 80 rupees a kilo went up to 110-115 rupees per kilo. The President had to inspect shops himself to regulate the price. The gazette notifications were issued every week to regulate the price of rice, but the Government failed to do so. There is no shortage of rice in the country. Large scale millers are increasing prices of rice by creating an artificial rice shortage. The Agriculture Minister has acknowledged to the media that these millers are hiding rice stocks. With the increasing rice prices the Government decided to import rice to counter the displeasure expressed by people. Importing rice by the Government is more like a business. These stocks are imported as buffer stocks and can be stored for two years before they go bad. But rice cannot be stored for that long due to rice weevils, decaying and worms. These stocks can be stored for two years due to chemical preservatives that are added. These stocks are not suitable for human consumption at all. They are embalmed rice. When the Government fails to locate the hidden stocks to regulate rice price it amounts to attempting to feed the poor with embalmed rice. These preservatives are more dangerous than the chemicals used by the farmers.",
    "\"Large scale millers earn a profit of 20 rupees from one kilo of rice and with thousands of rice stocks released per day, they earn excessive profits. I have made complaints to every institute with the evidence I posses. Rice stocks imported to reduce the price of rice are used as animal feed at the end. The ACFF has made everyone aware of it. The ACFF went to state owned paddy storage facilities in Hingurakgoda and Colombo together with a media team to find reasons for the increase of rice price after the President assumed power. During the visit the participants witnessed rice imported in 2017 being loaded to be used as animal feed. 54,000 kilos of rice imported during the Yahapalana Government were sold as animal feed in 2020 by the current Government and I was able to show the whole country this incident. Rice imported in 2014 during the Mahinda Rajapaksa Government was sold as animal feed in 2016 by the Yahapalana Government. The report of the Auditor General dated 30.12.2016 clearly shows the loss of 15,157 million rupees caused by the import of rice in 2014 and this outweighs the Bond Scam and the Sugar Scam,\" underscored Karunaratne.",
    "The rice mafia is operated through an agreement and there is evidence to prove that. Importing 100,000 metric tons of rice is also a part of this mafia. The Government does not interfere when large scale millers purchase paddy at low prices. The regulation of paddy prices exists on paper and does not control the market price at all All Ceylon Farmers’ Federation (ACFF) National Coordinator\"",
    "Misconducts of one government are not dealt with by successive governments in keeping with law. \"They are only helping each other. Importing rice to control rice price has become a business. Minister Aluthgamage said in Parliament that more than 80 metric tons of rice and paddy had been released as animal feed in 2015. This is true. We proved with evidence that the Yahapalana Government sold paddy as animal feed at 24 rupees a kilo which they had bought at 50 rupees a kilo. We cannot guarantee that the imported stock this year will not be sold as animal feed. These stocks released as animal feed are never used as animal feed. The buyers send them back to paddy mills to have them polished. Then they are mixed with rice produced locally and sent to markets labelled as ‘Made in Sri Lanka’. Rice stocks bought at 18-24 rupees as animal feed are sold in the market at 110-150 rupees earning a profit of about 70 rupees,\" explained Karunaratne.",
    "So far there is no shortage of rice in the country. Data and statistics obtained from the Department of Agriculture, Hector Kobbekaduwa Agrarian Research Institute and Central Bank reports reveal that 3.5 million metric tons of paddy are required annually for consumption with 100,000 metric tons of paddy to be used as seed paddy. Altogether 3.7 million metric tons of paddy or 2.4 million metric tons of rice are required. It is 200,000 metric tons per month. 4,792,000 metric tons of paddy were received in 2019 and amount was 5,030,000 in 2020. 1,092,000 metric tons of paddy left from the 2019 harvest were to be used in 2020. That additional amount and the 2020 harvest altogether gave 6,129,000 metric tons for 2021. After 37,000 metric tons of paddy have been allocated for consumption and to be used as seed paddy for 2020, there is a remainder of 2,429,000. It was reported that three million metric tons of paddy were received from 2021 Maha season as harvest and there is a remainder of 5.7 million metric tons of paddy. Even if some of that is to be consumed, with the harvest of this year’s Yala season there is no any need to import rice at all,\" said Karunaratne.",
    "Large-scale millers call the shots",
    "Importing rice affects the farmers as well. As soon as the announcement was made on importing rice the price of paddy dropped. When rice is imported consumers would have to eat embalmed rice. Small and medium-scale millers cannot compete with large-scale millers when the authorities reduce the prices of paddy and when large scale millers increase the purchasing price of paddy. The Government has paved the way for large-scale millers to create a rice mafia,\" he added.",
    "I will do everything to break the monopoly for rice in the market and to sweep away the rice mafia either by fining or by imposing state guaranteed prices. One million metric tons of rice produced locally are left over every year and the stocks are hidden by large scale millers\"",
    "Agriculture Minister Mahindananda Aluthgamage",
    "Agriculture Minister Mahindananda Aluthgamage said that even if tenders have been called for to import rice, no tenders have been issued yet and the price of rice dropped by 10 rupees as soon as concerns about importing rice were made public. \"I will do everything to break the monopoly for rice in the market and to sweep away the rice mafia either by fining or by imposing state guaranteed prices. One million metric tons of rice produced locally are left over every year and the stocks are hidden by large scale millers. They buy at cheap prices the paddy that our farmers grow from subsidies given to them through loans obtained from local banks and earn billons of profits. I will do everything to root out this mafia. Even if rice is to be imported this time, I promise that those stocks will not be sold as animal feed. I will also take legal actions against those who are hiding rice stocks,\" said Aluthgamage. Attempts made by us to contact Trade Minister Bandula Gunawardena proved futile as he was engaged in an urgent meeting. A senior officer of the Trade Ministry said that the Government would take every step to destroy the rice mafia. Even if tenders have been called for, tenders have not been issued yet. As the Act was amended, the Consumer Affairs Authority would continue to conduct raids and take legal actions against those who sell rice at higher prices, he added.",
    "The CAA said that the traders in the past kept selling rice at higher prices due to the drawbacks in the Act. As the Act is now amended, legal actions would be taken against those who sell rice at higher prices and hide stocks. Araliya Company Chairman Dudley Sirisena said that he could not comment on this matter as he was not willing to enter into a dispute with the Government.",
    "‘Nipuna Sahal’ Owner State Minister Siripala Gamlath said that there is no hidden rice stocks or any mafia related to rice and he could not make a statement on it as he was a State Minister. Though the state minister wanted us to contact his son, who is in charge of the business, our attempts made to reach him were futile."
  ]
}