{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/eye/Japanese-Officials-Ignore-a-Dying-Womans-Cries-for-Help/372-212323",
  "ut": 1621488540,
  "time_id": "2021-05-20-0529",
  "title": "Japanese Officials Ignore a Dying Woman’s Cries for Help",
  "paragraphs": [
    "A Sri Lankan student, detained by the Japanese immigration begged to be released to a hospital for medical care.",
    "They thought she pretended to be ill to avoid deportation.",
    "She died on March 6, 2021 alone in her cell.",
    "Protesters holding up pictures of Wishma during a demonstration in Tokyo. (Courtesy: Kyodo)",
    "The records reviewed by Daily Mirror show instructions from a doctor reading: \"If (medicine) cannot be administered orally, she should receive an IV drip and be hospitalised.\" The comment contradicts the content of the interim report, which says no recommendation for hospitalisation was made",
    "Wishma dreamed of becoming an English teacher in Japan. She loved the country, its culture, and its people so dearly that when her mother was nervous about sending Wishma alone to an unknown country, Wishma said \"It is Japan. I am gonna be safe and fine.\"",
    "It was around 11 a.m. when Wishma started struggling to breathe. In her solitary confinement, she groaned in pain for hours before falling silent near 1.30 p.m. She received no emergency treatment whatsoever for more than two hours, despite the cell being under 24/7 CCTV surveillance, Japanese government records detailing circumstances leading to the death reveal. After 2 p.m., when officers visited the cell, they found Wishma’s lifeless body.",
    "Sri Lankan student Wishma Sandamali, 33, languished in Nagoya Immigration Center in Japan, awaiting provisional release for six and a half months. Once a healthy and fit young woman who weighed 85 kg, Wishma lost more than 19 kg during the detention period, her health records say. Her condition continued to deteriorate. She died on March 6, 2021, triggering allegations that critically ill detainees are neglected by the Japanese immigration service.",
    "Even though she had been diagnosed with suspected Oesophagitis, the treatment she received was focused on her mental health.",
    "Even though her health deteriorated week after week with her symptoms of Oesophagitis started getting worse, neither was she given IV drip (intravenous drip) nor was she hospitalised.",
    "The reason is also evident in an interim report, compiled and issued by Japan’s Immigration Bureau. From the very beginning, the immigration officers thought Wishma faked illnesses to get released.",
    "Yasunori Matsui, a supporter from the START -- an organisation for refugees and migrants -- had written to the officials multiple times regarding Wishma’s deteriorating health.",
    "\"We had filed requests for her to be hospitalised and put on an IV drip, but the immigration bureau just kept saying she was fine. I am forced to say they left her to die.\" Matsui said.",
    "A university graduate and English teacher, Wishma flew to her dream destination lawfully in June 2017, eyeing the skyline like any newcomer.",
    "Her status of residence at the time of her entry was \"college student\" and her period of stay was one year and three months. However, she became unable to continue her studies when she ran out of money to pay for school and ended up overstaying in the country.",
    "She applied for refugee status in September 2018 and she was permitted for a stay of two more months with no work permitted. When she applied for a renewal of refugee status in December, she was not permitted over lack of reasons.",
    "This resulted in her losing her status of residence. She was arrested in August 2020 and charged for violating Japanese immigration control law. Foreign nationals in Japan after the expiry of their allocated period of stay are detained at government detention centres until they return to their home countries. She was immediately sent to the Nagoya Detention Center.",
    "Circumstances leading to the death as revealed by the interim report",
    "Wishma started complaining of vomiting in mid-August, 2020 and it continued throughout her detention period. In mid-January, 2021, she began complaining of stomach pain, nausea, loss of appetite, and numbness of the body. By mid-February, her condition grew too weak to walk or even stand, and that she required assistance from the staff at the immigration centre to go to the toilet and even change clothes.",
    "Her blood tests in January showed mild polycythemia (an increase of red blood cells in the body). However, the interim investigation report states that the part-time doctor at the internal medical centre who examined Wishma on January 28, took a \"wait-and-see approach.\" The doctor instructed to test Wishma’s blood in another two months.",
    "On the night of January 28, Wishma vomited blood and requested the officials at the facility to take her to a hospital. But, they didn’t. Within the next few days, the frequency of vomiting increased and intake of provided meals started decreasing. Then, she was moved from a shared room to a single cell. The authorities also started counselling for Wishma as they thought from the very beginning that she malingered.",
    "From January 2021 until she died, she suffered from constipation. In early February, the gastroenterologist who examined Wishma by a gastric endoscope suspected reflux Oesophagitis (inflammation of the tube that sends food from mouth to stomach). A supporter from a non-government agency who had looked into Wishma’s matter requested the immigration officials to take Wishma to a nearby hospital and provide her drip-infusion (medication drip from a bag through a tube into a catheter). However, doctors said it was not necessary.",
    "Later, when she continued complaining of pains and difficulties in her body, she was asked to see a psychiatrist. The interim report stated that although psychiatric consultation was ordered on February 16, the COVID-19 situation in nearby hospitals \"hampered the process.\"",
    "It was only on March 4, two days before her death, Wishma was brought to a psychiatrist. The interim report says that since Wishma did not request a consultation with a doctor after February 22, she wasn’t provided with any medical treatment until March 4 the date, reserved for the psychiatrist.",
    "Since the last week of February, Wishma often has laid on the bed and needed assistance to move her body. She even used diapers as she could not move to even go to the toilet. All of this happened inside her tiny cell. Two days before her death, the psychiatrist who checked Wishma suspected Somatic Symptom Disorder (mental disorder that manifests as physical symptoms that suggest illness or injury). However, the CT scans performed on Wishma on the same day revealed no abnormalities in her brain. But, she was prescribed antipsychotics and sleep inducers.",
    "On the day before her death, she spent most of her time sleeping under the effect of the medicine. On March 6, hours before death, officers who, as usual, visited Wishma to check her blood pressure and pulse could not measure them due to \"an error in the technical instruments.\"",
    "When officers instructed Wishma to have breakfast, she could not communicate; only cried and moaned in pain. It was around 11 a.m, Wishma started struggling to breathe.",
    "The interim report which has been compiled checking CCTV footage inside the cell after Wishma’s death clearly details Wishma’s movement on March 6. It states how she desperately struggled for hours to breathe. After 2 p.m, when officers visited the cell, they found Wishma without a pulse.",
    "A letter Wishma sent to a volunteer at START in February",
    "The cause of death, as mentioned in her death certificate was diagnosed as acute hepatic insufficiency. The type of death is categorised as unknown. The psychiatrist noted that they could not find a cause for Wishma’s death from the psychiatric point of view. However, the lengthy interim report released on April 9 has also failed to determine the cause of her death.",
    "In post-death hospital records, it says that Wishma was normal till noon on March 6. But, she has been breathing heavily and since the morning on the same day, according to the interim report detailing care provided for her. There are also discrepancies between the medical records compiled by her doctor (obtained by her family lawyer) in February and the content of the immigration bureau’s report. The omitted information is a set of remarks made by a doctor when Wishma underwent a stomach endoscopy at a hospital outside the detention centre.",
    "The records reviewed by Daily Mirror show instructions from a doctor reading: \"If (medicine) cannot be administered orally, she should receive an IV drip and be hospitalised.\" The comment contradicts the content of the interim report, which says no recommendation for hospitalisation was made.",
    "When this was questioned recently at a House of Representatives Committee on Judicial Affairs’ board meeting, the Japanese Justice Ministry explained that while Wishma’s medical records were obtained before an interim report on her death was created, the regional immigration services bureau responded that the \"doctor’s records were non-factual.\"As a result, the ministry said, the report it filed contained differing information.",
    "\"I am not well at all. Please help me ASAP. They won’t take me to a hospital outside because I am in their (immigration centre) custody. I want to recover. But what can I do? I don’t want to bother you, but I have no one else who cares about me,\" Wishma wrote on February 2 to her supporters.",
    "Yasunori Matsui from the START had been meeting with Wishma since December 2020. Mr Matsui who witnessed the deteriorating condition of Wishma during visits had written to the bureau requesting them to admit her to hospital. But, officials said it was not necessary.",
    "There have been several protest rallies by Japanese groups supporting foreign workers and refugees, demanding the government to reveal the truth behind Wishma’s death. Members of the Japanese rights group START, chanted phrases including, \"Why didn’t you save her?\" and, \"We want you to change.\" Protesters were heard saying slogans, including, \"Totally unforgivable,\" and, \"Reveal the truth.\"",
    "A petition they submitted reads:",
    "\"The incident was caused by neglecting medical care. Clarify who has responsibility for the management, and release. We need an apology and the truth as soon as possible. To stop this from happening again, we ask you to change your policies from one of the single-minded deportations to one that considers the circumstances of the individuals involved and offers them relief.\" In response to the allegations, Immigration Bureau officials informed the protesters that, \"we are currently under investigation by the ministry (of justice), and therefore cannot respond.\"",
    "We received condolences, not answers to our questions: Family",
    "Wishma’s mother, a widow, had taken out a mortgage loan to send her eldest daughter to Japan. Now she is struggling to process the amount of grief.",
    "\"There was nobody to give a drop of saline to a selfless person like my daughter who had donated so much in her life. She always went beyond her limits to help people. But, in her dream country of Japan, they left her to die like an animal. They watched her die,\" mother lamented.",
    "Her sisters criticised that they felt as if the immigration agency was \"covering the truth.\" The Japanese government officials including the subject Minister who met with the sisters who are currently in Japan have offered condolences and but did not give answers, the family complained.",
    "The sisters met with the Head of Japanese Immigration Centers and also the Minister of Justice on Tuesday (18). For all the questions they raised, the response from the officials was the same \"we are very sad about what has happened. An investigation is underway.\"",
    "They also visited the single-person cell where Wishma was detained, describing it as \"small and as if for an animal.\" \"They heard her insisting that she was unwell and wanted to be taken to a hospital outside. But, immigration officers repeated to her, ‘there’s nothing wrong with you,’ as she continued to be in distress,\" said Wayomi Nisansala, a sister of Wishma, referring to detention center staff.",
    "\"Those who are working in embassies have no compassion to represent their people in those countries. They have no mechanism to monitor Sri Lankans living there. They simply do not care.\"",
    "Problems in Japanese immigration centres not new",
    "According to Japanese media reports, in recent years, inmates have died one after another in other detention centres as well. But, the Immigration Bureau keeps rejecting allegations of negligence. Japanese immigration facilities have been criticised in and outside the country for their lengthy detention periods.",
    "When inquired by the Daily Mirror, Chandana Weerasena, Deputy Chief of Mission, Embassy of Sri Lanka in Tokyo, Japan said as of 17 of March 2021, there were 26 Sri Lankan detainees under the Japanese Immigration detention centres. All of them have been charged for illegal stay (overstay) in the country.",
    "He claimed that the Japanese authorities initiated the investigation into Wishma’s death as per the request made by Sri Lankan Embassy. He also stated that until the final report on the death is issued by the Japanese authorities, the Embassy would not release any media statement concerning Wishma’s matter. The final report is set to be released in July.",
    "Meanwhile, Kazuna Yamamoto, President of Voice Up Japan organisation during an interview with the Daily Mirror stated that Wishma’s death and deaths of 14 other non-Japanese detainees, died over the past 17 years could have been prevented.",
    "She also stated that the government of Japan on Tuesday (18) was forced to drop a draft revision to the Japanese Immigration Control and Refugee Recognition Act, which proposed forcible deportation and criminalisation of those who are applying for refugee status in Japan for the third time due to growing condemnation and pressure over the death of Wishma.",
    "Wishma dreamed of becoming an English teacher in Japan. She loved the country, its culture, and its people so dearly that when her mother was nervous about sending Wishma alone to an unknown country, Wishma said \"It is Japan. I am gonna be safe and fine.\"",
    "Illustrations done by Wishma while she was being detained"
  ]
}