{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/insight/Are-Chinese-COVID-19-jabs-effective-against-the-Delta-variant/374-215062",
  "ut": 1625019600,
  "time_id": "2021-06-30-0220",
  "title": "Are Chinese COVID-19 jabs effective against the Delta variant?",
  "paragraphs": [
    "On Monday Sri Lanka’s Health Ministry confirmed that three Covid-19 patients were suspected to have contracted the Delta Variant of Covid-19 also known as the B.1.617.2 Indian variant. Officials said that this is in addition to the five COVID-19 patients identified in Dematagoda on June 17, who have been confirmed to have contracted the Delta variant. Samples obtained from these three patients have been sent to the University of Sri Jayewardenepura to determine the variant following genome sequencing.",
    "Questions are now being asked if the current vaccines utilised in Sri Lanka are effective against the deadly Delta variant which has wreaked havoc in neighbouring India. Sri Lanka initially inoculated its frontline workers with the AstraZeneca Covishield vaccine granted by India. Since the disruption of supplies from the Serum Institute of India which mass produced the vaccine, Sri Lanka has been reliant on the Chinese Sinopharm vaccine to inoculate its citizens.",
    "\"Many countries rely heavily on Chinese vaccines to inoculate their citizens, but there are growing concerns about whether they provide enough protection against the Delta variant\"",
    "Many countries from China to Indonesia and Brazil rely heavily on Chinese vaccines to inoculate their citizens against COVID-19, but there are growing concerns about whether they provide enough protection against the Delta variant, first identified in India. Below are views from China’s health experts about the effectiveness of home-grown vaccines against the Delta, which is becoming the globally dominant variant, and virus preventive measures China is taking.",
    "DO CHINESE VACCINES WORK AGAINST DELTA?",
    "China has not provided vaccine effectiveness results against the variant based on large-scale data in clinical trials or real-world use, nor offered detailed information from lab tests, but Chinese experts are urging people to get inoculated as soon as possible. The lack of detailed data on the Chinese vaccines against the Delta has hobbled any meaningful peer reviews by foreign experts.",
    "Researchers found that Chinese vaccines are somewhat effective in reducing the risk of symptomatic and severe cases caused by Delta, Zhong Nanshan, an epidemiologist who helped shape China’s COVID-19 response, told reporters.",
    "It is based on analysis of infections in Guangzhou city, and Zhong told Reuters the results are preliminary and the sample size is small. Sinovac spokesman Liu Peicheng told Reuters preliminary results based on blood samples from those vaccinated with its shot showed a three-fold reduction in neutralising effect against the Delta. He said a booster shot following the two dose-based regimen could quickly elicit stronger and more durable antibody reaction against the Delta. However, he didn’t provide detailed data.",
    "Antibodies triggered by two Chinese vaccines are less effective against the Delta compared with other variants, Feng Zijian, former deputy director at the Chinese Center for Disease Control and Prevention, told state media last week. Feng did not provide details including the name of the two vaccines. The shots could still offer protection, since none of those vaccinated in southern Guangdong province, where China’s first cases of the Delta variant were found, developed severe symptoms. All severe cases are from unvaccinated people.",
    "Jin Dong-Yan, a virologist at the University of Hong Kong, said Feng’s comment alone is not enough to back up the claim that Chinese vaccines are effective against severe cases, as more data is needed. Indonesia, which has reported record daily cases recently due to a surge in the Delta variant, saw hundreds of medical workers infected by the COVID-19 despite being vaccinated with Sinovac’s shot, officials said earlier this month. It was not immediately clear, however, if the Indonesian medical workers were infected by the Delta variant.",
    "HOW DO THEY COMPARE WITH WESTERN SHOTS?",
    "A study by Public Health England (PHE) found in May the Pfizer-BioNTech vaccine was 88% effective against symptomatic disease from the Delta two weeks after the second dose. That compared with 93% effectiveness against the Alpha variant, first identified in Britain. Two doses of the AstraZeneca vaccine were 60% effective against symptomatic disease from the Delta compared with 66% effectiveness against the Alpha, PHE said. There is no substantial data showing how protective Johnson & Johnson’s single-dose COVID-19 vaccine is, and U.S. infectious disease experts are weighing the need for booster shots using mRNA vaccines.",
    "HOW SEVERE WAS THE GUANGDONG OUTBREAK?",
    "Guangdong, China’s major manufacturing and export hub, became the country’s biggest cluster of Delta cases since reporting its first locally transmitted Delta variant infection in May. The Delta infections included 146 cases in Guangdong’s capital Guangzhou and several cases from the southern tech hub of Shenzhen and nearby Dongguan city. No new domestic transmissions of any variant have been reported in the province from June 22.",
    "Guangdong, which has 126 million people (6 times the size of Sri Lankan population), has fast-tracked its vaccination effort since the outbreak. It had administered just 39.15 million doses as of May 19, but the number shot up to 101.12 million by June 20. Guangzhou, Shenzhen and Dongguan quickly sealed off neighbourhoods where those who were infected and their contacts visited and launched multiple rounds of mass testing, following the protocols observed during previous outbreaks.",
    "The cities also required those travelling out of the province to show proof of negative COVID-19 test results. Zhong, the epidemiologist, said that without effective control measures 7.3 million people in Guangzhou city would have been infected in the first 20 to 30 days after the initial case."
  ]
}