{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/curated_by_yanika_amarasekera/THE-PURSUIT-OF-SELF-AWARENESS-AND-SELF-LOVE/428-216309",
  "ut": 1626501600,
  "time_id": "2021-07-17-0600",
  "title": "THE PURSUIT OF SELF-AWARENESS AND SELF-LOVE",
  "paragraphs": [
    "The pursuit of self-awareness, self-love, and empathy have evolved into a way of life over the past few years. With more individuals investing greater amounts of time, energy and resources into their own physical and mental well-being, they are attempting to equip themselves to show up as the best versions of themselves. This week's column will spotlight a collection of resources that will help in this quest; the books and podcasts featured below span a spectrum from intuitive to complex, collectively nudging us to be a little more gentle with ourselves, more forgiving and a whole lot more self-aware.",
    "Despite the myriad of self-help books and advice columns out there, one relationship-framework has stood the test of time: The Five Languages of Love. Despite remaining a steadfast fixture on the New York Times best-seller list since 2009, this ground-breaking theory that seems so instinctive at first, yet revelatory all at once, remains widely unknown.",
    "In short, the theory states that there are five primary ways a romantic partner chooses to express love, and in turn, would prefer to receive it (and often, the manner in which one expresses love tends to also be the preferred way of receiving it).",
    "Words of Affirmation: Expressing your love verbally, think frequent ‘I love you’s,\" compliments, and validation.",
    "Acts of Service: Somewhat of an antithesis to the above, acts of service belong within the realm of \"actions speak louder than words\" – this can include anything from running an errand on your partner’s behalf to helping them with dinner.",
    "Quality Time: While this is, as self-explanatory as it sounds, the key is being fully present during the time you both carve out for yourselves.",
    "Physical Affection: Need we say more?",
    "Gift Giving: As Champan aptly puts it, this \"visual symbol of love\" can be something sweet and sentimental, or extravagant and over-the-top.",
    "This begs the question, why has Chapman’s theory been so significant? Because, understanding the Five Languages will not only help you realise the type of love you need in order to feel at peace, content, and secure in a relationship (which can then be conveyed to your partner) but it also helps in identifying all the ways your partner may be showing love towards you; they may just not be in ways that you instinctively and inherently recognise. Collectively, Chapman’s framework provides a lens for both partners to understand the wants and needs of the other in a constructive way.",
    "This unique podcast, The Joy of Procrastination, hosted by a duo with years of experience as strategic coaches, aims to remove the shame and guilt associated with procrastination and instead, illustrates the ways in which procrastination can be made productive.",
    "As they astutely note, \"Everybody does it [procrastinate]! I mean, there are 7.3 billion people on this planet and everybody does this, every single day, about something, but they also think that other people don’t.\"",
    "In addition to equipping their listeners on how to use procrastination to their advantage, what I particularly love is their overriding message on removing the guilt associated with it.",
    "We live in a culture in which shame and guilt unfortunately dictate a large part of our lives and act as primary motivators in adopting healthier habits. For instance, we’re more likely to exercise as a result of the shame from overeating as opposed to doing so for the love of moving our bodies. While shame and guilt have certainly proven to be effective within this realm, energising ourselves through a kinder mindset may help make the day-to-day mundane activities more joyful.",
    "Ester Perel, a world renowned New York Times best-selling author and psychologist rose to fame through her Ted Talk, \"Rethinking infidelity, a talk for anyone who has loved,\" (for those of you who are yet to watch it, I cannot recommend it enough!). Her new podcast, Where Should We Begin?, delves deeper into the topics that haunt most marriages: financial struggles, infidelity, mistrust, and more.",
    "The podcast takes the format of a therapy session, with Perel sitting down with different couples in each episode, as they discuss and navigate through their own respective struggles. Rather than romanticizing how relationships should unfold, Perel offers pragmatic, practical advice. What makes the podcast particularly compelling is the awareness and empathy it helps foster; it is not often that one has to listen to the side of a disagreement they don’t resonate with, and Where Should We Begin offers just that."
  ]
}