{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business-news/CIC-Holdings-maintains-growth-momentum-in-first-quarter/273-216835",
  "ut": 1627260420,
  "time_id": "2021-07-26-0047",
  "title": "CIC Holdings maintains growth momentum in first quarter",
  "paragraphs": [
    "CIC Holdings PLC delivered strong revenues and profits for the three months ended in June 30 (1Q22), maintaining the momentum it gained last year, as the group’s interests in multiple business lines stood to benefit from pandemic created conditions, policy title towards domestic production and the group’s yearlong strategic realignment, which ended recently.",
    "CIC, which has interests in agri produce, livestock solutions, heath and personal care, industrial solutions and crop solutions, generated revenues of Rs.9.05 billion for the quarter under review, up 15 percent year-on-year (YoY). While all its business segments performed well at the top line level, livestock solutions segment did notably well during the three months with the continued strong demand for poultry feed due to increased demand for chicken and other poultry produce.",
    "This unit reported revenues of Rs.2.6 billion for the quarter, up by 45 percent YoY.As the government’s ban on chemical fertilizer imports looked to cloud the group’s crop solutions business, CIC Holdings’ preemptive inroads into organic fertilizer production and the subsequent strengthening of its capacity, are expected to fortify any adverse impacts that could stem from its chemical fertilizer business. CIC Holdings is one of the largest fertilizer importers and blenders in the country, and its crop solutions segment, which captures the fertilizer business, saw its revenues staying virtual unchanged at Rs.2.8 billion from the same period, last year, although it isn’t yet clear if the recent ban on chemical fertilizer had anything do with the stagnant revenues.",
    "\"Having already ventured into the manufacture and distribution of organic fertilizer, albeit on a small scale, we will now ramp up production in order to align with government policy and will strive to do our utmost best to further support this government initiative,\" said CIC Holdings Chairman Harsha Amarasekera in his annual review of operations just two-week into the ban.",
    "The group reported earnings of Rs.1.94 a share or Rs.736 million for the quarter under review compared to earnings of Rs.1.00 a share or Rs.380.82 million reported for the same period, last year.",
    "The earnings were also supported by the significantly lower finance cost as the group paid down sizeable amount of its debt during the year to June 30 although it added about Rs.1.92 billion in fresh short-term debt in the June quarter. The net finance cost fell to Rs.112.2 million during the June quarter compared to Rs.301.0 million in the year earlier period, as the lower borrowing costs also helped the group to refinance its exiting borrowings.",
    "However the group’s gross profit margin was seen narrowing after its increase in direct costs outstripped the growth in revenues resulting in only 1.6 percent increase in gross profit. Operating profits at all segments with the exception of livestock solutions and industrial solutions declined, reflecting the pressure on costs, which may have stemmed from higher import costs.",
    "However, the group’s health and personal care segment which houses its pharmaceutical importation and production business and the ‘Link’ branded herbal care products generated higher revenues for the quarter under review.",
    "The group’s industrial solutions business generated higher revenues riding on the pick up in construction activities, while its agri produce segment which runs a chain of ‘Fresheez’ outlets and the manufacturer of dairy products range under ‘Creamoo’ brand, also did well at the top line level.",
    "As at June 30, 2021 Captain family-controlled Paints & General Industries Limited had 53.31 percent stake in CIC Holdings, while the Employees’ Provident Fund (EPF) had 9.06 percent stake being its second largest shareholder. EPF also had 12.7 percent stake in the company’s non-voting shares being the largest shareholder."
  ]
}