{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business-news/Countrywide-prices-up-6-1-in-June/273-216834",
  "ut": 1627260300,
  "time_id": "2021-07-26-0045",
  "title": "Countrywide prices up 6.1% in June",
  "paragraphs": [
    "National prices continued to remain high in June as prices of food items continued their climb, while the non-food prices followed suit amid effects of the fuel price hike in the second week of the month feeding to transport costs, which rose sharply.",
    "The inflation measured by the National Consumer Price Index (NCPI) or the broader gauge of the change in the consumer prices across the country, rose by 6.1 percent during the twelve months to June 2021, unchanged from a month ago but the prices rose from levels seen in May.",
    "On a month-on-month (MoM) basis, the NCPI based inflation accelerated to 1.5 percent from 1.0 percent in May from the impact coming from both food and non-food inflation. For instance, food prices rose by 9.8 percent during the twelve months to June 2021. Although this was a deceleration from the 10.3 percent in May, prices rose from the levels seen in May by 2.6 percent, accelerating from 1.7 percent in May, continuing the ascent in food prices for the third month in a row. Among the major food categories in which prices rose most were: rice, vegetables, coconut oil, fresh fish, dried fish and Mysore dhal. Meanwhile the prices of fresh fruit and coconuts declined slightly. Due to persistently escalating food prices, the government last week engaged with rice mill owners to explore the possibility of bringing the rice prices down. As a result of the discussions, the rice mill owners have reportedly agreed to purchase paddy at rates no higher than the government guaranteed prices. The Central Bank however thinks that the current bout of inflation is only transitory and will not be persistent, as price pressures were largely caused by the disruptions to domestic food supply chains, and these price pressures could dissipate when the restrictions ease. Meanwhile, non-food prices rose by 2.9 percent in the twelve months to June, accelerating from 2.5 percent in May while the MoM prices increased by 0.4 percent, up from 0.3 percent in May, amid the effects of the fuel price increase on June 11.",
    "The transport subcategory under non-food basket rose the most during June, of which spending on petrol had the biggest impact as petrol prices rose by between Rs.20 and Rs.23 a litre affecting the middle income class the most as they generally drive their automobiles to work while about another 1.5 million drive three-wheelers daily.",
    "Meanwhile, the so-called core prices measured barring the often-volatile items such as food, energy and transport, rose by 4.1 percent in the twelve months to June, easing from 4.2 percent in May."
  ]
}