{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/food_for_thought_by_zara_esufally_and_humaira_azee/What-is-peer-pressure-and-what-effect-does-it-have-on-those-who-experience-it/429-216769",
  "ut": 1627106400,
  "time_id": "2021-07-24-0600",
  "title": "What is peer pressure and what effect does it have on those who experience it?",
  "paragraphs": [
    "Most us have experienced peer pressure at some point in our lives, for a variety of different reasons. For example, we may have felt pressure to dress a certain way, hang out with certain people, or engage in activities such as drinking or partying.",
    "Peer pressure can be defined as the pressure placed on an individual by others in their social group to conform to a certain set of characteristics in order to fit in. Examples of social groups in which peer pressure may take place include school classes, workplaces, and even family environments.",
    "Although generally perceived to be negative, there are some instances wherein peer pressure may be seen as positive. For example, if a social group endorses positive behaviours such as studying hard or saving money, individual group members are likely to continue to practice these behaviours even when they are no longer in the presence of their group. On the other hand, the more common negative examples of peer pressure include encouraging discriminatory behaviour, pushing peers to consume drugs or alcohol, or convincing peers to miss work or school.",
    "It may be difficult to differentiate between signs that somebody is being negatively peer pressured and signs that someone is being bullied or struggling with their mental health. However, some important things to keep an eye out for if you are worried that someone you know may be a victim of peer pressure are:",
    "Heightened self-consciousness",
    "Avoidance of environments in which pressuring may take place",
    "Peer pressure plays an especially big role in the lives of children as the expectations of their social group can shape the kind of person they grow to become. However, like most social phenomena, peer pressure has both benefits, and drawbacks.",
    "Some of the benefits of positive peer pressure are:",
    "It can push people to try out new activities",
    "It can help in building strong relationships",
    "It can set an example as to which behaviours are tolerated in society and which aren’t",
    "It can allow people to learn about adapting to different social norms",
    "It can teach people which social groups they want to be a part of",
    "Some of the drawbacks of negative peer pressure are:",
    "It can lead people to engage in risky behaviour such as drug abuse or reckless driving",
    "It can result in feelings of anxiety of low mood as a result of feeling left out",
    "It can create arguments between family members, colleagues, or friends",
    "It can distract people from their goals",
    "It can cause sudden changes in behaviour or appearance",
    "Although peer pressure can be difficult to handle, learning some easy coping mechanisms are sure to help. Some examples include:",
    "Coming up with an exit plan in the case that you are being pressured into an activity that you do not want to partake in. This can include calling a friend or a parent.",
    "Choosing your social circles carefully so that you can as far as possible prevent yourself from being in uncomfortable situations.",
    "If you are a parent, you can teach your child which trusted adults they can rely on when they need to get out of certain situations.",
    "For most of us, peer pressure is something we have experienced multiple times throughout our lives. However, with the right coping mechanisms in place, we are all capable of making the best decisions for ourselves!"
  ]
}