{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/Another-petition-filed-in-SC-challenging-Finance-Bill/108-216880",
  "ut": 1627304400,
  "time_id": "2021-07-26-1300",
  "title": "Another petition filed in SC challenging Finance Bill",
  "paragraphs": [
    "Former Deputy Secretary of the Ceylon Bank Employees Union (CBEU) today filed a Special Determination petition in Supreme Court seeking a declaration that the Bill titled \"Finance\" requires the approval by the people at a Referendum in addition to the 2/3 approval of the Parliament.",
    "The petitioner Ekeshwara Kottegoda Vithana filed this petition through Attorney-at-law Dharshana Weraduwage in terms of Article 121 of the Constitution read with Article 120, the constitutional jurisdiction of the Supreme Court.",
    "The Bill titled \"Finance\" was placed on the Order Paper of Parliament on July, 20 2021.",
    "The petitioner stated that clauses 3,4,5 and 6 of the bill make unequal treatment on tax payers, giving full immunity from liability to pay any tax, penalty or interest or from any investigation or prosecution under the provisions of the law.",
    "The petitioner said such treatment is a violation of the Fundamental Rights of the tax payers who had already submitted their Tax returns on time and have duly paid their taxes under applicable rates.",
    "The petitioner further states that, the clause 7 of the Bill violates the citizens Right to Information and Sri",
    "Lanka’s various international and domestic obligations concerning anti-money laundering, anti-corruption or terrorist financing. The Petitioner reiterated that such provisions are serious threat to the National Security of the Country which includes Economic Security as well.",
    "In this petition, the petitioner had named Attorney General as respondent in terms of Article 134(1) of the Constitution.",
    "At a previous occasion, Samagi Jana Balawegaya parliamentarian Eran Wickremaratne and JVP former parliamentarian Sunil Hadunneththi had also filed separate petitions challenging the constitutionality of this Finance Bill."
  ]
}