{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/headline/WATCH-Milka-Gehani-blooms-hope-with-Olympic-debut-performance/419-216813",
  "ut": 1627242660,
  "time_id": "2021-07-25-1951",
  "title": "WATCH: Milka Gehani blooms hope with Olympic debut performance",
  "paragraphs": [
    "By Shehan Daniel reporting from Tokyo, Japan",
    "The final ranking may not paint a perfect picture, but there were brushstrokes of promise in Milka Gehani’s performance in the Tokyo 2020 Women’s Artistic Gymnastics event today, even if the end product lacked finesse.",
    "No matter how she did, Gehani would be remembered in light of her blazing a trail which has never been tread before, as the first Sri Lankan to take part in an Olympic gymnastic competition.",
    "Her opponents were bigger, more expressive and daring, better drilled and confident, the gulf in class too evident, but 18-year-old Gehani showed a glimpse that even when she hadn’t done her best, she could put it behind and come back better.",
    "Gehani began her routine on the Balance Beam, where a few shaky moments saw her lose footing, but she recovered and posted a score of 11.266.",
    "If there was one routine that she was noticeably weak at, it was the Floor, where a stumble early on cost her, with an execution of only 5.8 resulting in her scoring just 10.3, the lowest of the five gymnasts in her group.",
    "It was after that, that Gehani showed her mental fortitude with an effort off the Vault that, though lacking the perfect landing, earned her a score of 13.366, with judges giving her an excellent 8.566 for her execution.",
    "That score helped her jump two places in the rankings, from 30 to 28, a position she held until the end of her Sub-division, the 10.866 she scored in the Uneven Bars proving insufficient to push her further up the rankings.",
    "Gehani had however dropped to 62nd by the end of the fourth of the five Sub-divisions.",
    "At the top of the All-Round rankings was Gold medal favourite Simone Biles of the United States of America, who held a .565 lead over her compatriot Sunisa Lee, who scored 57.166.",
    "Hot on their heels were three athletes from the Russian Olympic Committee, Angelina Melnikova, Vladislava Urazova and Vikoriia Listunova.",
    "Tomorrow, Sri Lanka’s hopes will lie with Chamara Dharmawardene, who will take part in the Men’s Judo — 73 kg category, facing Aden-Alexandre Houssein of Djobouti in a Round of 16 match. Dharmawardene benefitted from a first-round bye.",
    "Also in action tomorrow is badminton star Niluka Karunaratne, who will play his final group play match again Nhat Nguyen of Ireland.",
    "Olympics 2020 LIVE update from Tokyo with Shehan Daniel #srilanka #lka #Olympics #OlympicGames #Olympics2020 #DailyMirrorlk pic.twitter.com/Ae3KnCoKz4"
  ]
}