{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/hard-talk/Trust-of-all-communities-and-ethnicities-is-important/334-216617",
  "ut": 1626920880,
  "time_id": "2021-07-22-0228",
  "title": "Trust of all communities and ethnicities is important",
  "paragraphs": [
    "The Prime Minister announced 100 special medical seats for Sri Lankan students in addition to the 1,000 scholarships already being offered",
    "The High Commission of Pakistan also donated Rs. 74 million (LKR). On behalf of the Pakistani government",
    "Pakistani High Commissioner Major General (R) Muhammad Saad Khattak, in an interview with Daily Mirror, discussed the current developments of bilateral relations between the two countries following Prime Minister Imran Khan’s visit in February, this year. The interview:",
    "Q During the visit of Pakistani Prime Minister Imran Khan, there were agreements for cooperation in various sectors. What tangible action have been taken since then to realise what was agreed upon? The Pakistani High Commission has constantly engaged with all relevant stake holders including the Sri Lankan President, the Prime Minister, the Cabinet ministers, the government officials and the business community to enhance the bilateral cooperation and economic collaboration between our two friendly countries. During his visit, the Pakistani Prime Minister stressed upon the importance of religious and cultural tourism and people-to-people contacts between the two countries. An MoU (Memorandum of Understanding) on tourism was also signed. Following the visit, a high-level 14-member Buddhist Monks’ delegation visit was arranged by the High Commission during April 2021 to promote religious tourism to Pakistan and to enhance people-to-people contacts between Pakistan and Sri Lanka. The visit was a success and created goodwill between the peoples of the two countries.",
    "Education assistance to Sri Lanka was another area that the Prime Minister was very keen on. Upon popular request of the Sri Lankan government, the Prime Minister announced 100 special medical seats for Sri Lankan students in addition to the 1,000 scholarships already being offered. Some other MoUs that were signed were between different Pakistani and Sri Lankan departments. They are in various stages of progress at the moment. Recently, the High Commission of Pakistan also donated Rs. 74 million (LKR). On behalf of the Pakistani government, two cheques were handed over to Sri Lankan President Gotabaya Rajapaksa. The amount of Rs. 66 million (equal to Pak Rs. 52 million) was announced by the Prime Minister of Pakistan during his visit to Sri Lanka in February this year for promotion of sports through training and equipment. Besides, Rs. 8.027 million was donated to the State Pharmaceutical Corporation of Sri Lanka for relief assistance of Covid-19 pandemic.",
    "The High Commission of Pakistan, in collaboration with Ministry of Commerce and Trade Development Authority of Pakistan (TDAP), organised a promotional event for Pakistani Dates (Fruit) Exports in Sri Lanka, at the High Commission in Colombo on April 8, 2021.",
    "Trade Diplomacy initiatives have been actively pursued by the High Commission through initiating dialogue under various existing bilateral engagement mechanisms, which had been pending for many years. In this regard, the 12th session of Pakistan-Sri Lanka Joint Economic Commission (JEC) was held on February 3, 2021, followed by the seventh Session of Commerce Secretary Level Talks. In pursuance of the agenda discussed in these two sessions, the Joint Working Group (JWG) on Trade, Investment and Auto Sector was revived through holding its second meeting on May 22. It had been pending since the first meeting held in 2014.",
    "Q Pakistan stood by Sri Lanka in Geneva against the UNHRC (United Nations Human Rights Council) resolution. In Pakistan’s point of view, how will the situation unfold for Sri Lanka? We have always stood by Sri Lanka at the UNHRC because we believe that any solution to a country’s problems cannot be effective unless the country in question is taken on board. We hope that the countries which brought the resolution as well as those that supported it should realise that Sri Lanka is a sovereign country which should be trusted to implement effective domestic mechanisms for reconciliation. We are also hopeful that the Sri Lanka government will visibly ensure that it has the trust and confidence of all communities and ethnicities in the country since only then, it will be able to effectively face International accountability challenges like the one at the UNHRC.",
    "Q The Pakistani Prime Minister mentioned that the CPEC (China Pakistan Economic Corridor) could be used by Sri Lankan businessmen to access markets in the Central Asian region. How feasible is this idea? Is there any progress in this regard? As you know that Central Asia is the largest landlocked area of the world which has suffered from poor access to global markets due to its geography. If Sri Lanka plans to access the Central Asian markets, it would need a secure land route and Pakistan can provide exactly that to Sri Lanka through CPEC. Sri Lanka and Pakistan are already trading partners and have signed a Free Trade Agreement (FTA). So, Sri Lanka’s trade with the CARs (Central Asian Region) can be very much feasible through Pakistan. The Prime Minister made this offer. Pakistan is receptive to Sri Lankan proposals in this regard. Nevertheless, the evolving situation in Afghanistan will have its impact on this initiative. Pakistan is hopeful that with the help of international community, the warring factions in Afghanistan will be able to peacefully resolve their domestic differences leading to a stable Afghanistan in the future.",
    "Q What are the future plans for the development of cultural cooperation? In line with Prime Minister Imran Khan’s vision to develop religious tourism to the famous Gandhara Buddhist heritage of Pakistan, a high-level Buddhist Monks’ visit was arranged by High Commission of Pakistan from 19-26th April 2021to promote religious tourism to Pakistan. The delegation was taken along the proposed Gandhara Buddhist Holy Trail starting from the Lahore Museum and all the way up to the Swat Valley. The main objective of the visit was to enlighten the Sri Lankan Buddhist community about the well-preserved and ancient remains of the Gandhara Civilization of Pakistan as well as to enhance people to people contacts between Pakistan and Sri Lanka.",
    "Moreover, we are in the process of launching a documentary film on the glorious Gandhara Civilization and Buddhist heritage of Pakistan. We are in touch with the Sri Lankan Prime Minister’s Office for the joint launch of this documentary. It will further boost the understanding and friendship of the two countries as well as across all the Buddhist countries in the world.",
    "Q What are the latest developments as far as defence cooperation in counter-terrorism is concerned? Pakistan and Sri Lanka enjoy the best of defence relations. Cooperation on counter terrorism is historically proven, when Pakistan extended all out to support our Sri Lankan brothers to end the 30- year- long war. Currently, a large number of Sri Lankan Armed Forces personnel undergo training at various institutions in Pakistan. Pakistan has always played a key role in combating the global threat of terrorism. Pakistan and Sri Lanka always exploit new opportunities and avenues for furthering ongoing counter terrorism cooperation. Recently, Pakistan and Sri Lankan Armies have conducted first of their bilateral Field Training Exercise \"Hand Shake\" in March 2021. Its focus was to exchange and learn from each other’s counter terrorism and counter insurgency experiences and share the best practices for mutual benefits.",
    "Q What follow-up action has been taken to develop the pharmaceutical sector as discussed during the visit of your Prime Minister in February, this year? Following the visit of Prime Minister and The Trade and Investment Conference 2021, The High Commission of Pakistan in Sri Lanka is constantly engaged with all the relevant stakeholders in order to enhance bilateral trade relations especially the pharmaceutical sector as one of the main priority sectors.",
    "Two MoUs were signed between M/s CCL Pharmaceuticals Pvt. Ltd, Pakistan and Hemas Pharmaceuticals Pvt. Ltd, Sri Lanka and M/s Genix Pharma Pvt. Ltd, Pakistan and M/s Emerchemie NB (Ceylon) Ltd, Sri Lanka respectively. The MoUs entailed collaboration in manufacturing, distribution and technology transfer in the pharmaceutical sector between Pakistan and Sri Lanka. It is pertinent to note that M/s Hemas Pharmaceuticals Pvt. Ltd, Sri Lanka, a top conglomerate, imports over 50 percent of the total pharmaceutical products from Pakistan and has maintained strong business linkages with leading Pakistani companies over the years.",
    "Trade and Investment Wing of Pakistan High Commission in collaboration with Federation Chamber of Commerce Sri Lanka organised the Webinar and B-2-B Sessions on \"Good health and Well-being for all 2030\" with a focus on bilateral trade and investment opportunities in pharmaceutical sector on March 18, 2020. The possibility of setting up joint facilities by the Pakistani Companies in Sri Lanka was discussed in detail. The importance of technology transfer in the pharmaceutical sector in Sri Lanka, provides an opportunity to Pakistani investors and a competitive advantage for Pakistani pharmaceutical manufacturers in Sri Lankan pharmaceutical industry. Government officials of both countries, top Sri Lankan companies, Pakistani investors and leading chambers participated in the forum.",
    "Q Sri Lanka is promoting the Colombo Port City as a gateway to South Asia. How does Pakistan view Colombo Port City? The geographic location is the main advantage. Unique selling proposition of the Port City of Colombo, cost advantage, investment opportunities, employment opportunities, infrastructures with international standards, 100 percent foreign ownership and relaxed exchange control regulations in the zone will give edge over other regional hubs and especially for South Asian investors. It would be a golden opportunity to start business in the same South Asian region for their investment projects and enhance the ease of doing business.",
    "Q Are Pakistani Companies interested in investing in the special economic zone under the Port City? Discussions were initiated with Colombo Port City management to attract Pakistani investors to Sri Lanka. The High Commission also facilitated the Port City management to visit Pakistan during which meetings were also arranged between Karachi Chamber of Commerce & Industry and Port City Management. The High Commission has always encouraged and facilitated Pakistani investments in Sri Lanka. However, we do urge the authorities concerned to enhance their efforts in attracting investment from Pakistan in high potential sectors."
  ]
}