{
  "url_hash": "cd1ac95a",
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/SL-worker-dies-in-industrial-accident-in-Korea-after-working-18-consecutive-hours/108-216977",
  "ut": 1627425060,
  "time_id": "2021-07-27-2231",
  "title": "SL worker dies in industrial accident in Korea after working 18 consecutive hours",
  "paragraphs": [
    "A Sri Lankan worker at a plastic manufacturing factory in Hwaseong, Gyeonggi Province,South Korea died in an industrial accident,the Korea Times reported.",
    "He had been working for 18 consecutive hours to meet a deadline.",
    "According to Hwaseong Seobu Police Station, the 33-year-old worker from Sri Lanka died at a plastic goods manufacturing factory in Paltan Township of Hwaseong City, at around 3:30 a.m. on July 25. He was caught in an oil pressure compressor while trying to replace the plate.",
    "There were two other workers of foreign nationality nearby, but they weren't aware of the accident until they heard the victim screaming, according to police. They immediately reported the situation to the manager of the factory, who then called 119 while on his way to the factory.",
    "Police said that the compressor, which had some oil pressure gas left in it, seemed to have started operating suddenly, but they are investigating the exact cause of the accident.",
    "The victim was a new worker who had joined the factory less than three months earlier.",
    "It turned out that the three workers of foreign nationality ― including the victim ― had been working for more than 18 consecutive hours, starting at 9 a.m. the previous day. The Korean factory manager had reportedly left the factory at 11 p.m., a few hours before the accident occurred.",
    "Police suspect the workers had to work overtime as the factory was having trouble meeting a deadline, due to a defect in production. They are also examining whether there were any violations of labor laws. Police plan to punish all those related to the factory management based on what kind of irregularities are found after their investigation, including analyzing surveillance footage recorded at the factory.",
    "Despite its advanced economic status and GDP, Korea is still infamous for both occupational accidents and overwork. It ranks in the top five among OECD member countries in terms of workplace fatality rate."
  ]
}