{
  "url_hash": "7048bad1",
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business-news/Lanka-IOC-1Q-earnings-reflect-travel-and-other-restrictions/273-216983",
  "ut": 1627434360,
  "time_id": "2021-07-28-0106",
  "title": "Lanka IOC 1Q earnings reflect travel and other restrictions",
  "paragraphs": [
    "Lanka IOC PLC saw its June quarter (1Q22) performance impacted by travel restrictions that were imposed from mid-April, but the performance was better than the year earlier period when restrictions were harsher.",
    "The downstream petroleum sector operator and Sri Lanka’s only private sector distributor of petroleum products reported revenues of Rs.16.9 billion for the quarter under review, up from Rs.10.7 billion in the corresponding period of 2020, when the restriction on movement due to COVID-19 was remained much harsher.",
    "The June 2021 revenue was however down from Rs.20.7 billion in the previous three months to March 2021 (4Q21).",
    "June 2021 quarter revenue would have also received a boost from the fuel price increase, which came into effect from June 11, when the government revised prices at the pump to reflect the rising global crude and refined oil prices and also to fend off negative implications on the country’s Balance of Payment.",
    "The company is also facing fresh challenges from the rising crude oil prices, which climbed from US$ 62.74 a barrel as of March 31, 2021, to US$ 74.62 a barrel by June 30 at the Brent futures exchange, due to rising demand for energy with the re-opening of economies around the world.",
    "After briefly touching below US$ 70 a barrel last week in response to the decision to increase output by OPEC plus countries, the price recovered again to US$ 74 a barrel.",
    "Lanka IOC reported earnings of 51 cents a share or Rs.273.1 million for the quarter under review compared to a loss of Rs.1.49 a share in the year earlier period.",
    "The company reported earnings of Rs.1.83 a share in the three months ended in March 31, 2021, when the economy was off to a flying start with both consumer and business activity gaining steam.",
    "During the three months to June 2021, the company had accumulated short-term debt to the tune of Rs.6.0 billion and as a result its finance cost more than doubled to Rs.122.6 million.",
    "However, notably, the inventories nearly doubled to Rs.18.8 billion during the three months.",
    "Lanka IOC is also into bunkering, bitumen and petrochemicals, and is the second largest lubricant marketer in the country with market share of 15 percent, after Chevron Lubricants.",
    "As of June 30, 2021, Indian Oil Corporation Limited held 75.12 percent stake in Lanka IOC."
  ]
}