{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business-news/Kuoni-unveils-2022-Indian-Ocean-programme/273-216940",
  "ut": 1627359240,
  "time_id": "2021-07-27-0414",
  "title": "Kuoni unveils 2022 Indian Ocean programme",
  "paragraphs": [
    "Kuoni has launched an expanded Indian Ocean programme for 2022, with the addition of 13 new resorts across the region.",
    "There are six new resorts in the Maldives, four in Mauritius, two in the Seychelles and one in Sri Lanka.",
    "The Maldives, Mauritius, Sri Lanka and the Seychelles already top Kuoni’s list of bestselling destinations for 2022, based on forward sales, making up more than half of the company’s advance bookings.",
    "The operator said the Indian Ocean is a popular honeymoon choice for couples, many of whom have rebooked following the postponed plans amid the pandemic.",
    "Kuoni is also seeing more demand for child-free resorts, special interest trips such as diving and ultra-luxury – with the average spend for 2022 Indian Ocean holidays up by 15 percent.",
    "The company said it has created a broader programme to position Kuoni as the number-one operator for premium Indian Ocean holidays and the collection has been designed with special occasion travel in mind, such as honeymoons and anniversaries.",
    "Product Director Claire Ross said, \"Every new resort we’ve added brings something different, so we can offer personalised itineraries backed up with flexibility and service from beginning to end.\"",
    "Kuoni Senior Programme Manager Sheena Paton added, \"This has been a huge project behind the scenes, to get ourselves ready and at the top of our game for a strong return for travel in 2022 and 2023.",
    "\"We’ve worked with our partners in these destinations to find the very best of what’s new on the market as well looking at customer trends to add more of what we know customers are asking for.\" (Courtesy https://travelweekly.co.uk/)"
  ]
}