{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/Tunisias-PM-sacked-after-violent-Covid-protests/108-216881",
  "ut": 1627306140,
  "time_id": "2021-07-26-1329",
  "title": "Tunisia’s PM sacked after violent Covid protests",
  "paragraphs": [
    "Tunisia's president has sacked the prime minister and suspended parliament, after violent mass protests nationwide on Sunday.",
    "Anger over the government's handling of a massive recent spike in Covid cases has added to general unrest over the nation's economic and social turmoil.",
    "President Kais Saied, who was elected in 2019, announced he was taking over.",
    "His supporters erupted in celebration, but opponents in parliament immediately accused him of staging a coup.",
    "Tunisia's revolution in 2011 is often held up as the sole success of the Arab Spring revolts across the region, but it has not led to stability economically or politically.",
    "The recent coronavirus surge - which saw the health minister sacked last week after a bungled vaccination operation - has fuelled long-standing frustration.",
    "Sunday saw thousands of people demonstrating against Prime Minister Hichem Mechichi and his moderate Islamist ruling party, Ennahda, shouting \"Get out!\".",
    "One protester, Lamia Meftahi, told Reuters news agency that this was \"the happiest moment since the revolution\".",
    "Security forces in the capital, Tunis, blocked off parliament and streets around the central Avenue Bourguiba.",
    "Protesters also stormed Ennahda offices, smashing computers and setting fire to its local headquarters in Touzeur.",
    "In a televised address, Mr Saied said: \"We have taken these decisions... until social peace returns to Tunisia and until we save the state.\"",
    "He later joined the celebrating crowds in Tunis.",
    "President Saied also vowed to respond to further violence with military force.",
    "\"I warn any who think of resorting to weapons… and whoever shoots a bullet, the armed forces will respond with bullets,\" he said.(BBC)"
  ]
}