{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/insight/Striking-through-the-pandemic/374-215516",
  "ut": 1625635980,
  "time_id": "2021-07-07-0533",
  "title": "Striking through the pandemic",
  "paragraphs": [
    "Nearly 38,000 nurses in Sri Lanka struck work last week claiming that negotiations with the government for better pay and improved working conditions had failed. Fifteen health sector trade unions engaged in the strike over several demands including salaries, allowances and promotions.",
    "The trade unions say nurses are underpaid amid worsening working conditions in the wake of the ongoing COVID-19 pandemic. \"Nurses are the glue, which holds healthcare services together. They gave their best during the pandemic. They risked their lives and those of their families. If they are on strike means there is a big problem that needs to be fixed,\" Saman Rathnapriya, the President of the Government Nursing Officers Association (GNOA) told Daily Mirror.",
    "He said the current salary levels were not conducive to retain the nursing staff while the workload and the lack of sufficient cadres are stretching them to breaking point, placing them and their patients at risk. \"Instead of appreciating the precious and vital services they provide, the Sri Lankan health ministry and the government have failed to respond to or are ignoring the nurses’ demands,\" Mr. Rathnapriya said.",
    "Impact on the healthcare system",
    "Due to the increasing number of COVID-19 patients and the resultant pressure on healthcare services, the importance of critical-care nurses has been recognised globally. In the context of Sri Lanka’s population, the ratio of nurses to patients stood at two to a 1,000 in 2018, which is far below the global average of 3.81 nurses to a 1,000 patients (World Health Organisation, 2018).",
    "Although the unions said their trade union action would only minimally impact on patients, many patients have undergone extreme difficulties at hospitals because of the problematic nexus between health workers and governments. Even the strike was launched with trade unions assuring it would not cripple healthcare services at specialised hospitals such as cancer, maternity, paediatric and COVID-care hospitals though medical service disruptions were reported at several treatment centres.",
    "According to reports received, the activities at many hospitals as well as vaccination and PCR testing centres were severely hampered with several hospitals cancelling non-urgent surgeries and out-patient clinics. The 15 trade unions engaged in the trade union action represent laboratory technicians, radiologists, pharmacists, and public health inspectors. By Monday (5) it was reported that the number of PCR tests being conducted countrywide had dropped below 10,000 from a daily average of 18,674 in June. On Monday, the number of PCR tests had dropped to 9279, which is less than 50% of last month’s daily average.",
    "Health Ministry officials view that this strike situation could worsen COVID-19 related issues in the country, leaving health services in a fix. Speaking to the Daily Mirror on Monday, Deputy Director-General of Health Services Dr. Hemantha Herath had said the vaccination programme had been somewhat hampered due to the trade union action.",
    "\"It is really unbecoming of the trade unions to strike work during the pandemic. When health officials decide to withdraw from work pertaining to COVID-19, it would vehemently affect the country at large. The situation might get worse. Also, it would add to the burden of the health service,\" he added.",
    "Same cycle of discussions and trade union action",
    "The trade union action has shut down a large part of Sri Lanka’s healthcare system, drawing attention to administrative and technical shortcomings and the problems besetting the nursing profession. However, it should be noted that nurses’ unions have carried out strike action several times during the past seven months of this year alone and while after every strike they had launched, there had been discussions and meetings between the unions and the government though those discussions have not been successful. During previous strikes, the demands were mainly regarding transport facilities for nurses, COVID vaccines, inadequate protective equipment, transfers and allowances for government special leave.",
    "During the walkout last month, silent protests were carried out -- at nine selected provincial hospitals in the country -- against the government’s failure to respond to the demands made by health workers. Several demands, including a proper healthcare system and the necessary facilities for the caring of COVID-19 infected healthcare workers and a risk allowance for health workers, were submitted to the government. On that occasion too the GNOA said the discussions it had held with the Health Minister and other responsible authorities with regard to their demands and related matters was of no avail, leaving them with no other option other than that of resorting to trade union action.",
    "Subsequent to June’s trade union action, Prime Minister Mahinda Rajapaksa had directed Health Minister Pavithra Wanniarachchi to recruit retired nursing staff, as and when required, on a contract basis to face the challenges posed by hospitals due to the COVID-19 global pandemic. He had directed that more nurses be provided with short-term training courses so that they could be assigned to the Intensive Care Units (ICUs). The Prime Minister is also reported to have said the Government was taking steps to grant a Nursing Degree, as done in many other countries. According to the Health Ministry, this proposal has already been sent to the Attorney General’s Department to draft the necessary legislation.",
    "\"\"On the second day of the strike there were three Covid-19 deaths. Sadly, we were unable to manage some patients due to this strike. As it is, there is some friction between the administration and the nursing staff of the hospital. With the strike, this affected patiet management as well,\" he opined\"",
    "After the last week’s strike was launched, President Gotabaya Rajapaksa called a meeting with the heads of the relevant trade unions and senior health officials. During the discussion, the President informed the relevant authorities to provide immediate solutions to five of the seven demands submitted by the nurses’ trade unions. He assured he would grant the remaining two demands through the next Budget.",
    "The President directed that necessary measures be implemented immediately to grant the following demands: 1) The opening of a Nursing University 2) The restoration of the staff status quo, which was suspended by the Yahapalana Government via circular No: 32/2017 on 07/12/2017 3) The reinstatement of the mechanism for promotions from grade iii to grade ii in five years and Grade ii to Grade i in seven years 4) The payment of an annual uniform allowance of Rs.20,000 and 5) The proposal to consider changing the current 36-hour working-week to five days or 30 hours a week to be referred to a special committee. The President also agreed to provide an allowance of Rs.10,000 and an additional service allowance of 1/100 of the basic salary as mentioned in a circular issued by the Ministry of Finance on 24/12/2014 through the upcoming Budget.",
    "*Lakmini Salgado, a nurse from a government hospital speaking to Daily Mirror said since thousands of nurses were struggling under unbearable patient loads, most of them leave work exhausted and unsatisfied having failed to deliver the kind of care they were trained to provide.",
    "\"Nurses are quitting -- not because they are not dedicated to serve during this global pandemic, but because they feel their work is not appreciated. They are not given salary increases. They do not have enough supplies at hospitals. All the nurses are demoralised. But, the administration blames us for anything that goes wrong within such a deficient system, even though we point out its shortcomings and failures regularly,\" she lamented. No sooner had the nurses called off their strike than the Joint Council of Professions Supplementary to Medicine (JCPSM) struck work. Despite discussions and assurances given by the President, trade unions have already warned that they would launch an indefinite nationwide strike from July 7 if officials fail to grant their demands as soon as possible.",
    "Trade union action cost patients",
    "Not all medical workers have been supportive of these workers’ decision to strike. Doctors at various hospitals have charged that the manner in which some nursing officers and trade union representatives have acted over the past week has been nothing less than despicable and inhumane.",
    "Speaking to the Daily Mirror one medical officer at a hospital in Ampara said that on the second day of the Trade union action, the behaviour of certain nursing officers at the hospital was shocking. \"There was a patient who needed urgent limb surgery, without which the patient would have lost his leg. But nursing officers refused to open the operation theatre, give surgical instruments or assist during the surgery,\" the doctor said.",
    "As with any emergency, immediate treatment was required, but only some healthcare officials seemed to understand the gravity of the situation. \"The patient was septic (the human body’s extreme response to an infection) It was a life threatening medical condition and the patient was in no situation for us to delay the treatment. But due to the ongoing strike the patient was kept outside the ward for three hours and sent back to the ward with no medical intervention to treat his condition,\" the doctor recalled.",
    "The doctors managed to open the locked theatre complex after six hours. Six critical hours which determined the outcome of the patient’s well-being. \"When the patient was wheeled in, one nursing officer questioned the emergency. ‘If the patient was a critical or emergency case, how come the patient is fine after a 6 hour delay?’ the nursing officer questioned.\"",
    "\"By the time we took the patient in, it was already a little too late. Fortunately we were able to save his limb with no amputation. Had the procedure been delayed any further, it would have been a different story,\" the doctor said.",
    "Covid-19 patients compromised, nurses refuse to care for critical cases",
    "At a Base Hospital in the Central Province where patients are being treated for Covid-19, doctors have been forced to deal with similar situations, but with far worse outcomes. \"We were informed of the trade union action just a day before. They had assured that emergency and Covid-19 services would not be affected by this strike. This was not the case however at my hospital. When decisions are taken by a trade union at the top, those decisions seemed to be interpreted in different ways, especially in the inner parts of the country,\" one doctor said. \"I work in a Covid-19 unit, which is basically like an Intensive Care Unit (ICU). We have 12 patients who are at the absolute worst condition. And we have had about one or two patients who succumb to this disease, daily, and we can’t change it,\" the medical officer said detailing the backdrop of the trade union action.",
    "\"On the second day of the strike there were three Covid-19 deaths. Sadly, we were unable to manage some patients due to this strike. As it is, there is some friction between the administration and the nursing staff of the hospital. With the strike, this affected patient management as well,\" he opined.\"In Colombo, I am told the situation was different. Nursing officers were not in uniform, but they were attending to all emergency units and patient care. This was not the situation here. In other hospitals, nurses were on strike but they were in the premises. In our hospitals the staff didn’t even report to work!\"",
    "Many doctors have voiced their disappointment in nursing staff who opted to refrain from caring for emergency and Covid-19 patients. \"If Covid-pneumonia patients don’t get their antibiotics on time, or if they are not given properly, they can develop worsening conditions. Eventually resistance occurs and the patient would die. It is the duty of the nurse to provide the drugs, as they are the ones who order and balance the drugs,\" the doctor said. \"On this particular day, patients were supposed to receive their medication at 6 o’ clock. The strike began only at 7 am, but the patients did not receive their drugs as they were not prepared by the nursing staff. Doctors aren’t trained as nurses are to do this role, and it was quite difficult. However, Consultant doctors who are far more experienced than we are, then arrived at the hospital and guided the doctors to make and manage these drugs,\" he recalled.",
    "Several medical officers the Daily Mirror spoke to are of the opinion that strike action is acceptable as long as it does not compromise the lives of critically ill patients. \"It’s not like emergency care patients call ahead and arrive at the hospital. This is why there are dedicated teams for this. We don’t mind people stopping to work at clinics or the OPD, but emergency services should not be affected,\" one doctor said. \"I’m not a big fan of the Government Medical Officers Association (GMOA) or their politics,\" one doctor said. \"But even when the GMOA calls for trade union action, only routine things are stopped. Surgeries and emergency treatment continue regardless of any trade union action,\" he said.",
    "Commenting on the demands put forward by the trade unions, one medical officer said the issue has been politicised. \"There are certain ratios of salaries that have to be maintained. If there was no such ratios, even we as medical officers can demand the salaries and benefits of consultant doctors. But for a consultant to get their it takes a decade of experience and education. You can’t give an executive pay to a person who holds a diploma, that is basic sense. They have been requesting to let them do a degree and that is fine. Everyone has the right to education. But there is a way to do it and you don’t do it during a pandemic. People are dying!\""
  ]
}