{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/SL-to-commence-manufacture-of-saline-and-affiliated-liquids-in-September/108-216947",
  "ut": 1627361760,
  "time_id": "2021-07-27-0456",
  "title": "SL to commence manufacture of saline and affiliated liquids in September",
  "paragraphs": [
    "In what appeared to be a breakthrough in the production of medical items, the government will fully depend on locally manufactured saline and other related liquid used in healthcare from September 1 ,2021 onwards , a move that will save US$ 5 million spent otherwise for imports annually, Daily Mirror learns .",
    "The Cabinet approved the memorandum in this regard yesterday evening.",
    "The government started manufacturing such products in line with the policy that all drugs and medical consumables with the potential to be produced locally up to international standards will be manufactured here.",
    "The State Ministry of Production, Supply and Regulation of Pharmaceuticals has directed the State Pharmaceutical Manufacturing Corporation (SPMC) to explore the possibilities of collaboratively manufacture the Essential Life Saving Critical Care/ Hospital Care Sterile Liquid Large Volume Parentals (SLLVP) under the SPMC logo and under the guidelines of the WHO current Good Manufacturing Practice (CGMP) and other relevant standards. They are large volumes of intravenous solutions such as dextrose solution,normal saline,hartmann’s solution and mannitol considered as SLLVPS.",
    "The SPMC has facilitated, by the end of 2019, a local Company M/s Kelun Life Sciences Pvt Limited to establish a plant in Pallekelle that has the capacity to manufacture around 43 million SLLVP’S per annum. This Plant facility had been approved by the National Medicines Regulatory Authority (NMRA). This Facility is the only sterile liquid injectable facility, which is ready to manufacture and supply the products from August 2021 and is in the process of obtaining all necessary approvals from the NMRA for the products. The proposed collaboration will not only facilitate the country to save around 5 million on net basis per annum, but it will also support the M/s Kelun Life Sciences Pvt Limited to export the excess of around 25 million Sllvp’s,generating muchneeded foreign exchange earnings. (KELUM BANDRA)"
  ]
}