{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/600-000-await-Astrazeneca-second-jab-but-where-are-the-doses/108-216642",
  "ut": 1626940080,
  "time_id": "2021-07-22-0748",
  "title": "600,000 await Astrazeneca second jab, but where are the doses?",
  "paragraphs": [
    "600,000 people are desperately awaiting the second dose of the Astrazeneca vaccine, which was expected to arrive in the country on July 19, but the date was later revised to July 21, but even as of today is yet to arrive.",
    "• 264, 000 doses of the Astrazeneca which was expected to arrive in the first week of July, also through the COVAX facility is expected to now arrive at the end of the month",
    "According to sources from the Health Ministry, 1.45 million doses of Astrazeneca are expected to arrive through the WHO’S COVAX facility from Japan, which local officials said would arrive by July 21. However when inquired by the Daily Mirror yesterday, senior sources from the Health Ministry said that while all documentation had been sent to Japan they were yet awaiting a date of arrival and it was likely to arrive end of this week or next while another senior official said it would arrive within this month.",
    "Further, 264, 000 doses of the Astrazeneca which was expected to arrive in the first week of July, also through the COVAX facility is expected to now arrive at the end of the month. Officials were unable to confirm any date. With the threat of the Delta variant having spread beyond control, and with some medical experts stating that Sri Lanka may be in the initial stages of a 4th wave of the pandemic, recipients of the Astrazeneca are worried and disgruntled at waiting for months without any proper confirmation as to when they may receive the second dose.",
    "An initial plan of rolling out the Pfizer vaccines as the second dose for those who received the Astrazeneca as the first dose was halted abruptly within a day after the government announced that they would await the arrival of Astrazeneca doses. The Pfizer vaccines, which in many countries is being rolled out as the second dose for Astrazeneca, is now being administered to students travelling overseas and on fishermen in the north who run a risk of coming in contact with infected Indian fishermen mid-sea.",
    "The 600,000 people who are desperately awaiting their second doses of Astrazeneca are all from the Western Province which has been one of the worst affected with the consecutive waves of the COVID-19 virus and now runs a risk from the vastly spreading Delta variant.(JAMILA HUSAIN)"
  ]
}