{
  "url_hash": "baca0f5b",
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business/Message-by-His-Excellency-Abdulla-Shahid-Minister-of-Foreign-Affairs-of-the-Republic-of-Maldives/215-216869",
  "ut": 1627290000,
  "time_id": "2021-07-26-0900",
  "title": "Message by His Excellency Abdulla Shahid Minister of Foreign Affairs of the Republic of Maldives",
  "paragraphs": [
    "As we mark the auspicious occasion of the 56th Anniversary of Independence Day of Maldives, I wish to extend sincere greetings and good wishes to all the Maldivian nationals residing in Sri Lanka. While rejoicing on this happy occasion with fellow Maldivians, we are mindful of those who have been affected by the Covid-19 pandemic both at home and abroad. We share their grief and stand with those who have been impacted, and are resolutely working to overcome the challenges posed by the pandemic.",
    "Today, we also celebrate the happy occasion of the 56th anniversary of establishing diplomatic relations with Sri Lanka. Sri Lanka is one of the first countries to establish formal ties with Maldives after gaining independence in 1965. But the close bonds that unite the Maldives and Sri Lanka go way back into history, long before our two countries established diplomatic relations. The friendship that was forged many centuries ago continues to grow, fortified by excellent bilateral partnership, and strong and dynamic people to people contact.",
    "On this auspicious occasion of celebrating 56 years of establishing diplomatic relations between the Maldives and Sri Lanka, let me also convey my appreciation to the President of Sri Lanka His Excellency Gotabaya Rajapaksa, the Prime Minister of Sri Lanka, Hon. Mahinda Rajapaksa and the Foreign Minister, Hon. Dinesh Gunawardena for the close cooperation and unwavering support extended to the Maldives, both at bilateral and at multilateral front. I am confident that our partnership will continue unabated as we collaborate to overcome the unprecedented challenges of the Covid-19 global pandemic.",
    "The Maldives and Sri Lanka share a long-standing fraternal relationship based on mutual respect, friendship and understanding. Maldives appreciates the invaluable and immeasurable assistance extended by the Sri Lankan Government to the Maldives and the large population of Maldivian nationals residing in Colombo in key socioeconomic areas. The kind and generous hospitality of the Sri Lankan Government and people towards Maldivians in Sri Lanka, assures them a warm and safe home away from home. We value and attach great importance to our ties as we continue supporting each other at all times. I am certain that our two Governments and peoples will work hand in hand, as we march ahead in building back better, stronger, greener and bluer.",
    "Let me once again wish all Maldivians a very happy Independence Day, and wish peace, prosperity, good health and happiness to the friendly people of Sri Lanka."
  ]
}