{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/business__main/Cabraal-assures-new-inflows-says-reserves-set-to-top-US-7bn/245-216941",
  "ut": 1627359300,
  "time_id": "2021-07-27-0415",
  "title": "Cabraal assures new inflows; says reserves set to top US $ 7bn",
  "paragraphs": [
    "Sri Lanka will have foreign reserves over US $ 7 billion within the next few months, even after the payment of US $ 1 billion sovereign bond settlement, which is due today, Finance State Minister Ajith Nivard Cabraal said.",
    "He said Sri Lanka has lined up inflows to the tune of US $ 2.65 billion over the next three months.",
    "Those include the US $ 400 million swap from Reserve Bank of India, US $ 250 million from Bangladesh Bank, US $ 300 million loan from China Development Bank, US $ 800 million worth of Special Drawing Rights from the International Monetary Fund, US $ 200 million from the Central Bank purchases from the forex market in the next three months, US $ 300 million by way inflows form the ISBs held by the local banks and US $ 400 million expected from the inflows from the utilisation of underutilised assets.",
    "Cabraal also said the Central Bank has also successfully negotiated a swap line with the People’s Bank of China for a sum of US $ 1.5 billion, which is kept as a buffer, to be accessed when the need arises.",
    "\"It has been noted that several opposition groups have been speculating about Sri Lanka’s forex reserve level and attempting to convey a status of instability.",
    "In that context, it must be stressed that what is most important is the cash flow, not the reserve level, at a given time. Experienced finance mangers will keep a close watch on the cash flows, as they very well know that temporary fluctuations in the reserve level may occur but that no destability will be caused, if the cash flow is managed successfully,\" Cabraal said.",
    "\"Sri Lanka has worked out its external cash flows in a manner so that every forex loan repayment and interest payment will be made on time, through the careful management of its existing reserves as well as expected inflows and outflows,\" he added.",
    "Cabraal also said arrangements are being made to rollover almost the entirety of the Sri Lanka Development Bonds (SLDBs) and foreign currency banking unit (FCBU) loans that are maturing over the balance part of the year, so that such maturities will not lead to a reduction in the reserves.",
    "\"Also noteworthy is the fact that with the repayment of the ISB on July 27, 2021, most of the government’s foreign debt service obligations for 2021 would have been repaid, allowing the country to replenish its reserves during the remainder of the year.",
    "Since the current forex reserve balance is at around US $ 3 billion after the payment of the ISB of US $ 1 billion on July 27, 2021, the available reserves within the next few months would be over US $ 7 billion, when considering the expected inflows and outflows,\" Cabraal noted."
  ]
}