{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/insight/Checks-and-Balances-of-Quarantine-Law/374-216618",
  "ut": 1626921420,
  "time_id": "2021-07-22-0237",
  "title": "Checks and Balances of Quarantine Law",
  "paragraphs": [
    "Checks and balances that are the foundation of the rule of law must be exercised so as to stop misuse of powers. However, reports have recently emerged claiming that public health justifications are allegedly used to restrict rights associated with freedom of speech. There have also been concerning reports regarding arrests and questionable detentions/ quarantine orders from government critics.",
    "Questions emerged as to how the pro-government gatherings seemed to have received special treatment or relief of the said health guidelines and restrictions. Fingers have been pointed at several politicians who have publicly and privately flouted both official restrictions and health guidelines now in force in the fight to eradicate the deadly virus.",
    "Questions emerged as to how the pro-government gatherings seemed to have received special treatment",
    "Critical questions to be answered Two weeks ago, more than twenty Trade Union activists including Ceylon Teachers Union Secretary Joseph Stalin were arrested during protests. Stalin was arrested during a protest against the proposed Kotelawala Defence University Bill, on July 8 for allegedly violating Quarantine Laws. They were protesting while claiming that the proposed law will lead to the privatisation and militarisation of the higher education sector in Sri Lanka.",
    "The protesters were produced in courts, where they were released on bail. However, they were put into vehicles and taken to quarantine centres. More than 10 education sector Trade Unions alleged the protesters were illegally detained at quarantine centres after being arrested at peaceful protests. In opposition to the arrests and detention of the activists, more than 240, 000 public school teachers withdrew from conducting the online teaching last week (12). Eight days after the arrests, the activists who had been placed under quarantine at a Quarantine Centre in Mullaitivu were released.",
    "Eight days after the arrests, the activists who had been placed under quarantine at a Quarantine Centre in Mullaitivu were released",
    "Meanwhile, Public Security Minister Sarath Weerasekara told Parliament that the protesters violated the rules and that police would continue to arrest violators in the future too. Human rights activists and Lawyers continue to question the government as to how health guidelines could restrict the right to freedom of expression and peaceful assembly. In an interview with Daily Mirror, Attorney- at- Law Jagath Liyanarachchi specified that \"while some rights may be limited during an emergency in order to protect public health and safety, such restrictions must be for a legitimate aim—in this case, to contain the COVID-19 pandemic. They must be proportionate to that aim, necessary, non-arbitrary, evidence-informed and lawful. Each order/law or action by law enforcement must also be reviewable by a Court of Law.\"",
    "Following are a set of crucial questions that are being posed, examining whether the measures are compatible with rights.",
    "Are the Coronavirus regulations precise enough for people to realise the legal implications of their actions? Is there a rational explanation as to how the sending of the \"lawbreakers\" to be quarantined, is applied? Is there a subset of the population that is particularly \"vulnerable\"? Is there enough adaptability in the measures to address different cases in different manner?",
    "The nexus between the Quarantine law and the right to freedom of expression or peaceful assembly Quarantine and Prevention of Diseases Ordinance is composed of 12 Sections and the Minister of Health is granted the power to make regulations thereunder. Although the regulations of the Ordinance were commended way back in 1890s, the applicability of those regulations in dealing with COVID-19 was cleared by Extraordinary Gazette No.2167/18 (20.03.2020). Section 12 of the regulations defines quarantine to mean \"the inspection, examination, exclusion, detention, observation, surveillance, segregation, isolation, protection, treatment, inoculation, vaccination, sanitary regulation, disinfection and disinsectisation of persons, animals, vessels, goods and things and any other measures having as their object the prevention of spread of certain diseases into Ceylon (Sri Lanka) from other countries from ships or to ships or other countries from Ceylon\".",
    "Is there a subset of the population that is particularly \"vulnerable\"? Is there enough adaptability in the measures to address different cases in different manner?",
    "The Ordinance also refers to Criminal Law. The Penal Code, Criminal Procedure Code, Police Ordinance and the Pubic Security Ordinance are such other laws that give effect to the Quarantine Ordinance. Attorney-at-Law Jagath Liyanarachchi explained how the enjoyment of fundamental rights guaranteed by the Constitution could be restricted through quarantine law.",
    "\"The right to freedom of expression and peaceful assembly is vested in our citizens by Article 14 of the Constitution and the limits on these rights are set out in Article 15. All rights reserved are mentioned in Article 12 and Article 13. These Articles can be exercised, enforced, and secured in order to protect the public health or morals, to ensure that the rights and freedoms of others are properly recognized and respected, and to meet the legitimate requirements of the law for the general welfare of a democratic society, but all within the prescribed legal limits.\"",
    "\"Accordingly, the Health Guidelines are issued by the Director General of Health Services and he has a legal and moral obligation to issue such guidelines, but since those guidelines do not fall within the definitions of the Constitution, the right to freedom of expression or peaceful assembly cannot be restricted,\" Liyanarachchi opined.",
    "National Movement for a Just Society: Travails of people in troubled times Speaking at a press conference, Chairman of the National Movement for a Just Society, Former Speaker of the Parliament Karu Jayasuriya alleged that the country was moving towards a very dark direction as the process of repression of the people had already begun. \"The country’s economy is going bankrupt. The existence of the people has become more precarious than ever. Today they are not even free to talk about the persecution they are suffering. The failure and incompetence of the government is being passed on to the people.\"",
    "Are the Coronavirus regulations precise enough for people to realise the legal implications of their actions?",
    "Mr.Jayasuriya was of the view that the government, instead of rescuing the people from the epidemic, was suppressing the people by using it as a cover and blessing. \"The country’s farmers are facing many problems. People of the working class have been left helpless, unable to make a living. The youth have lost faith in the future. As a result, the people have taken to the streets.\"",
    "He added that the legal community and the Judiciary in the country should pay more attention to the events than anyone else. The main Lawyers’ Association in the country – The Bar Association of Sri Lanka (BASL) -- last week wrote to the authorities.",
    "Is there a rational explanation as to how the sending of the \"lawbreakers\" to be quarantined, is applied?",
    "BASL: Quarantine only those who contracted the disease or suspected to have contracted the disease In its letter addressed to the Director General of Health Services Dr. Asela Gunewardena and Inspector General of Police Chandana Wickremeratne, the BASL stated that the rights under Article 14 of the Constitution may be restricted by law in the interests of public health. However, such restriction must be done by law; must have a nexus to the objective sought to be achieved and must be reasonable.",
    "The BASL stressed that none of the regulations and announcements made by the health authorities have contemplated a total prohibition of meetings and protests but only sought to prevent meetings and protests involving a mass gathering of people.",
    "While affirming that any organised protests should be carried out in a manner that it did not pose a risk to public health, the BASL questioned how at a time the Director General of Health Services had thought it fit to ease restrictions previously imposed, the Police acted in a heavy-handed manner when dealing with the protesters. It also noted that quarantining has necessarily to relate to a person who had contracted the disease or is suspected to have contracted the disease and to no other. Therefore, the Bar Association emphasised that quarantine should not be used as a punishment or mode of detention.",
    "\"Accordingly, the Health Guidelines are issued by the Director General of Health Services and he has a legal and moral obligation to issue such guidelines, but since those guidelines do not fall within the definitions of the Constitution, the right to freedom of expression or peaceful assembly cannot be restricted\"",
    "AI: Many governments have gone far beyond reasonable and justified restrictions Allegations on misuse of quarantine law are not coming just from Sri Lanka. Amnesty International recently claimed that in many instances documented by the AI, restrictions go much further - for example imposing blanket bans on protests, prohibiting or restricting protests where other public gatherings of similar sizes remained unaffected; or using force against peaceful protesters. Where law enforcement fulfills a legitimate and necessary role, AI called for governments across the globe to ensure that law enforcement agencies respect their ultimate mission to serve and protect the population.",
    "The police arresting an elderly woman who took part in a demonstration at the Polduwa Roundabout on July 08 against the proposed Kotelawala Defence University Bill",
    "Celebrations held in Gothatuwa, Colombo on July 8 for Basil Rajapaksa's return to the Parliament"
  ]
}