{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/hard-talk/Sri-Lanka-Cricket-didnt-take-parliament-seriously-Prof-Charitha-Herath/334-216025",
  "ut": 1626223080,
  "time_id": "2021-07-14-0038",
  "title": "“Sri Lanka Cricket didn’t take parliament  seriously”  - Prof. Charitha Herath",
  "paragraphs": [
    "The Daily Mirror recently spoke to Chairman of the Committee on Public Enterprises (COPE) Prof. Charitha Herath on the recent reviews carried out by the committee on state entities. The live discussion on Twitter Spaces offered the audience a unique opportunity to engage with the COPE Chair directly. Excerpts of the interview.",
    "Q The COPE is often seen as a toothless body. Critics have often pointed out that this leaves questions about accountability, stating that there are loopholes as well. What is your view on the matter?",
    "Your observation is true. We don’t have executive or judicial powers that were given to some institutions and the executive of the country. We are looking at the issues and developing different kinds of tools, in order to make use of our inquiries.",
    "Number one, we report to the Chamber, where they could take up the matter and develop different kinds of processes to address the issues. Number two, we directly instruct the chief accounting officer meaning, the secretary of the relevant ministry, to take legal action if needed, or to take some procedural, technical, official steps for the issues. Third is the most important thing, to get the issue into the public.",
    "That is in my opinion is the best part and the most important part of this, where the issue comes to the public through media. At the end of the day the ownership of the country is with the people. So the people would know what is going on with this particular sector or area. I think in these three ways, we are implementing our experiences and engagements with COPE.",
    "Q Does that mean we look forward to a committee with more powers?",
    "That is not what I mentioned. I think even in the current status, it is enough to address an issue. We are not here to punish or judge any legal matters. The COPE members are directing relevant parties to take up a matter with the Attorney General’s Department for future actions. But I think greater democracy has three main components, executive, judiciary and parliamentary affairs. So what we do is to look at this as an oversight committee and to suggest to the executives to take up the decisions and report back to the people.",
    "Q Do you think the COPE should necessarily reflect the party composition in the House? Would it be better practice to have a member of the opposition to chair the Committee?",
    "Well that is one interesting question. We formed this committee in 1979. I’m the 15th Chairman of COPE and five members served in this position while being in the opposition and 10 members have served here from the government side. So regardless of where they are coming from, government or opposition, there were some good chairmen who delivered good outcomes. There were some bad ones as well who did not deliver the expectations. That did not depend on the party they belonged to. People say that D.E.W. Gunasekara and Wijeyadasa Rajapakshe were good chairs of the committee. But they were also from the government. So in my opinion, if they are delivering the expectation, then that is what we need to look at.",
    "Q Let’s talk about two entities that have been making the news lately, Sri Lanka Insurance and Litro Gas. Can you explain to us what exactly has been going on here?",
    "Well, the first thing is that there is a court case on this matter and I have to be very careful in making some explanations outside parliament. As we all know, Litro Gas was acquired by the government entity called Sri Lanka Insurance Corporation (SLIC). SLIC has invested in many other institutions as well. After the company was acquired, they are being registered under the 2007 Company Act and now they have a separate legally established board of directors for this new company. There was an issue with the 19th Amendment and there was a technical error of words. There was a question about the ‘companies under corporations’ which was the term that was used.",
    "Now SLIC is not a corporation per se. It is now a limited company. Due to these technical differences, whether or not some of these institutions can be examined by the Auditor General (AG) has been the issue. The present Litro Gas Board has also made its position clear that they would be hiring an outside auditor for their auditing purposes and that the AG’s Department cannot be allowed to perform an audit. The COPE Chair and the parliament, as well as the Attorney General maintain a different view that the AG should be given the right to audit.",
    "This was the issue that came into discussion and now the Litro Board has gone to court and they are maintaining their position. But we have summoned the SLIC Board Chairman and the Secretary of that Ministry and have instructed them to give directions to allow the AG Department to examine their accounts.",
    "Q Another body under scrutiny, which has caused frustration for many citizens here is Sri Lanka Cricket. What were the major findings when COPE reviewed its performance earlier this year? What were the most identifiable issues of concern?",
    "Number one, they were not prepared enough and they were not taking the parliament seriously. They were not considering the issues that COPE had asked them to answer. That was the biggest issue; we had to send them back, asking them to come prepared. When they came back, there were different kinds of issues to discuss.",
    "One of them was the relationship between the Government of Sri Lanka and Sri Lanka Cricket. They maintained the view that they are a body appointed by some sport organizations and that the Government is not financing them. They said that they have all authority to make use of the money, which they make.",
    "The second point was that there were many interesting developments within their structure where they had been paying some of their clubs unjustifiable amounts of money. Some can view this as a bribe that they are paying continuously from one election year up to the next election year, in order to maintain that particular vote. We discussed this issue.",
    "Also some mismanagement of properties was also discussed. The main issue that we had was a particular account which had been established outside of this country under the name of Sri Lanka Cricket. There were some transactions done to that account. Now the Criminal Investigations Department also examined the issue. We have given them 6 months before we summon them again to review these issues.",
    "Q COPE instructed the Secretary of the Ministry of Sports to take legal action against some members of the SLC. Is there a legitimate reason for the prosecution of these officials?",
    "The Secretary of the Ministry has power under the Sports Act while the Director General of Sports has the authority to engage with any sports clubs in this country. It was the only way that we could initiate some kind of inquiry. We instructed them to consult the Attorney General’s department and take up the next steps.",
    "Q Earlier you mentioned that SLC didn’t take parliament seriously. Has there been any change in this stance recently?",
    "Well I think now they are taking the matter seriously because the media and people of this country are engaging in these discussions. At the end of the day, it is the country brand. It is not their private or personal company or club-related entity. Sri Lanka belongs to all of us and the brand of Sri Lanka Cricket is owned by the Sri Lankan people. It seems now they have understood that, but unfortunately the results aren’t good from the ground. Many people are leaving their interest in this sport and going into different kinds of lines. So we think as members of the COPE we are not executing any decisions within their administrative systems. We hope that they will take up the",
    "challenges and issues and make Sri Lanka Cricket a proud cricketing nation again. We will be anyway exerting pressure on their financial administrative side when they are summoned again.",
    "Q Being an academic yourself, what is your view of the new Kotelawala National Defence University Bill? Is it really a good idea?",
    "This bill was first presented for discussion in 2018 it seems and then it was resubmitted and discussed last week. There are different kinds of areas we need to look at. I personally think that we should take time to study this Act and then go back to the parliament. Some members of the government were also of the view that this Act should be reviewed. My opinion is that we need to restructure the education system as a policy. Our education needs a complete restructuring plan, higher education as well as school education.",
    "At the moment what we can see is that there are many different kinds of universities coming in. Those universities were registered under the Board of Investment Act, but were still affiliated to some prestigious universities outside the country and then they are providing recognised degrees. We have only one higher education act, the 1978 University Act. As there are many universities coming up, we need to look at the issue in a productive way. Some may ask that if the KDU Act is the productive way. My answer would be I don’t think so. But this is one attempt and one kind of practice which was accepted and established in the government in 2010. One particular issue that I observed was how we admit students into this university. The system that would be developed under this new act should have justifiable ways to select students into their system. There were different kinds of opinions, and as a democratic government I think we will look at these problematic parts.",
    "Audience Question : You mentioned that Sri Lanka needs to work a lot more on foreign affairs. I’d be interested to understand more details on that. Where do you think we need to do some work?",
    "American, Japanese and Indian engagements under the Asia Pacific strategy is moving forward. These relationships are developing along different lines. At the same time Chinese engagement too has developed into different levels. China has linked with Pakistan, Bangladesh and some other countries as well as Sri Lanka. So now the South China Sea and the Indian Ocean are more political spaces where we all should engage as a country which does not have that much bargaining power in economic terms. But still we could make use of our position right now in this region to develop a kind of balance in our foreign policy positions on different topics. I have suggested within the government’s internal discussions that we should develop a couple of important think tanks under the Ministry of Foreign Affairs. We have at the moment Lakshman Kadirgamar Centre for Strategic Studies etc. We need to use these intellectual arms in order to develop good strategies to engage with these developing regional political engagements.",
    "This discussion has been edited and condensed for clarity"
  ]
}