{
  "url_hash": "a4899000",
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/breaking_news/Sri-Lanka-surpasses-global-vaccination-average/108-216922",
  "ut": 1627352100,
  "time_id": "2021-07-27-0215",
  "title": "Sri Lanka surpasses global vaccination average",
  "paragraphs": [
    "With nearly 57 percent of target population having administered with at least a dose of COVID-19 vaccine, Sri Lanka has been able to surpass the global vaccination average, the Health Promotion Bureau (HPB) said yesterday.",
    "HPB Director Ranjith Batuwanthudawa told Daily Mirror that Sri Lanka had been able to vaccinate a satisfactory number of the target population which means people above the age of 30 dragging the country above the global vaccination average.",
    "\"When considering the percentage of people who have received at least a single dose, Sri Lanka have been able to perform better than developed countries. It’s a great achievement,\" he underlined.",
    "\"We have been able to vaccinate a large number of people within a shorter period of time because of the interest and enthusiasm shown by people in getting the vaccine,\" HPB Director said.",
    "He said they were very much optimistic that they would be able to achieve the target set by the President that people above 30 in the Western Province should be vaccinated before the end of July.",
    "Going into statistics, Dr Batuwanthudawa said at least 90 percent of people above 30 have been received at least the fist dose of COVID-19 vaccine in four districts such as Colombo, Gampaha, Matale and Mannar.",
    "\"96.8 percent of target population in Colombo has received at least a single dose while it stands at 95.9 percent, 93.7 percent and 90.5 percent in Gampaha, Matale and Mannar districts respectively,\" he added.",
    "Also, 15.1 percent of target population have been offered with both the doses.",
    "Meanwhile, Dr Batuwanthudawa stressed the point that receiving the vaccine alone would not mean that we all are protected from the virus.",
    "\"Any COVID-19 vaccine does provide shield against coronavirus. However, if we are to protect fully from the virus, we have to strictly adhere to health guidelines and practices until a considerable period of time,\" he added. (Sheain Fernandopulle)"
  ]
}