{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/cricket/Sanath-Jayasuriya-signs-as-coach-at-Melbourne-cricket-club-Mulgrave/315-213415",
  "ut": 1622797980,
  "time_id": "2021-06-04-0913",
  "title": "Sanath Jayasuriya signs as coach at Melbourne cricket club Mulgrave",
  "paragraphs": [
    "Sri Lanka great Sanath Jayasuriya will coach in Melbourne next season after putting pen to paper with an ambitious Eastern Cricket Association club.",
    "Jayasuriya will lead Mulgrave, which had already signed Tillakaratne Dilshan and Upul Tharanga as players in a fruitful off-season recruiting campaign.",
    "Jayasuriya is the latest former international star to land at Mully, with the decorated World Cup winner signing on for one season with the option to extend his stay.",
    "Jayasuriya and Dilshan were teammates in the Sri Lanka Legends’ side earlier this year, which helped seal the coup.",
    "\"It’s exciting. We’ve been having a chat to him for a while through obviously Dilshan as a contact. They caught up during the legends series and started having a few discussions,\" Mulgrave president Malin Pullenayegam said.",
    "\"Dilshan opened the door for us there, and it was a fantastic opportunity that was presented to us. We just had to work on it and come to an agreement, and we have.",
    "\"I think it’s a great opportunity for our young guys to know what international cricket standards are.\"",
    "The 51-year-old is the fourth highest run-scorer in one-day international, his relentless assaults on bowlers during the 1996 World Cup living long in the memories of ardent cricket fans as he was crowned player of the tournament.",
    "Jayasuriya piled on 13430 runs at 32.26 in the 50-over format and was a formidable batsman in Test matches, hitting 6973 runs at 40.07.",
    "He represented Sri Lanka 586 times across the three formats, scoring 42 centuries at the elite level.",
    "Jayasuriya’s left-arm spinners delivered 440 wickets and he also captained the national team before becoming a selector.",
    "Asked if Jayasuriya could take the field for Mulgrave, Pullenayegam said: \"The contract is to coach. Of course if he feels like he wants to play a couple of the T20s, we’ll definitely let him do that, but it’s at his discretion at the moment.\"",
    "Dilshan has been appointed Mully’s captain for next summer, while Tharanga only retired from the international ranks in February.",
    "They formed a successful opening combination in one-day cricket and are set to cause myriad headaches for opposition bowlers in the ECA.",
    "Pullenayegam said Mulgrave was working hard to establish itself as a destination club.",
    "\"You want the juniors especially to see what international cricketers are like, how they train, what their attitudes are,\" he said.",
    "\"That kind of exposure from a young age just elevates the standard of cricket they’ll be playing.",
    "\"We’re hoping to attract as many people as possible to watch the games.",
    "\"Obviously being a community cricket club, we’re not funded by anyone, so we’re hoping to get some sponsorship so we can develop the club a bit more and give better opportunity to the juniors, cricketers within the club and the community.\"",
    "Mulgrave finished runner-up in the ECA’s third-tier A Turf and Twenty20 competitions in a productive 2020-21.",
    "Jayasuriya is living in Sri Lanka and will make preparations for a move to Melbourne in coming months."
  ]
}