{
  "source": "www.dailymirror.lk",
  "url": "https://www.dailymirror.lk/hard-talk/WE-NEVER-LEARN-LESSONS-FROM-THE-PAST-MP-IMTHIAZ-BAKEER-MARKAR/334-216920",
  "ut": 1627344060,
  "time_id": "2021-07-27-0001",
  "title": "“WE NEVER LEARN LESSONS FROM THE PAST” -MP IMTHIAZ BAKEER MARKAR",
  "paragraphs": [
    "With more than three decades of experience in Parliament former Media and Housing Minister Imthiaz Bakeer Markar returned to Parliament from the main Opposition Samagi Jana Balawegaya (SJB). The son of former Speaker Mohammed Abdul Bakeer Markar, Imthiaz was attracted to politics as early as from his schooling days. A strong campaigner for the total representation of every section in the society- including professionals, females, all races and religions- MP Markar emphasises on the importance of getting the younger generation involved in politics. Appointed as the Deputy Chairman of the Kalutara District Development Council in 1981 he entered parliament from the United National Party (UNP) in 1988, and held different posts and portfolios under UNP Governments and the opposition. In 2019 Markar joined the SJB and entered parliament from the national list. Excerpts of an interview done with Markar;",
    "Q You entered parliament more than thirty years ago and attended parliament for many years working under different Prime Ministers and Opposition leaders. How do you see the quality of MPs then and now?",
    "I entered Parliament for the first time in 1988. Even before that I had a deep interest in politics. From the time I attended school and at the time when Dudley Senanayake was UNP Leader I took the initiative to start a student movement in our party. Then I became the Secretary of the Youth Front of the UNP and Inter-University United National Party President and I gathered some experience in politics. Since there was a political background in my family when I was in grade 8 I used to visit the Parliamentary gallery and follow debates. When you look at the Parliament then and now, in a way I feel sad. The parliament then had depth. It was respectable place. Parliament was a place where there was principled politics. It was a place filled with the educated. There could be different political views and principles, but there was respect among the MPs then. I still can remember when the budget speech was delivered, it was Bernard Soysa who opened the floor. I still could remember how Dudley Senanayake listened to Soysa’s speech attentively with his hand on his face. Even my father never missed Bernard Soysa’s speech. It was a politics that respected each other. When I was sitting in the gallery, I could remember Robert Gunawardene, who had lost the election, too being present to listen to the speech. Whether it was Left wing or right wing or liberal or conservative, whatever ideas they had there was respect for each other. And the parliament represented a cross section of the society. But when you listen to the speeches made in the parliament at present I don’t see any depth. Most of them make speeches to gain political mileage. This conduct is very sad.",
    "When you look at the Parliament then and now, in a way I feel sad. The parliament then had depth. It was respectable place. Parliament was a place where there was principled politics. It was a place filled with the educated. There could be different political views and principles, but there was respect among the MPs then",
    "We must understand that when we say that we do not have educated people in our parliament it was the society which selects these parliamentarians. The people who select the parliamentarians has a great responsibility. Not only the voters the media also has a great responsibility. People take decision based on the available information. The media has a responsibility to report the truth. If media institutions give up on their responsibilities stating that their newspaper companies were taken over by the Government and others and neglect their responsibilities to receive perks and privileges and if the media go to the lap of the leaders it’s only useless information that reaches the people. Then people would select their representatives based on wrong information. So the media also have a responsibility in providing people with accurate and truthful information. I recently took an example based on a statement made by Gordon Brown and Tony Blair. They said that they joined the war against Iraq since they didn’t receive the accurate information provided by George Bush. They said \"We were told that Iraq was having weapons of mass destruction. We are regretting it\". But by the time they started regretting it was not only issues regarding oil that cropped up, many people had paid with their lives. One of the world’s oldest civilisations, Babylonian civilisation, was destroyed. These are lessons for us. So the people and the media have a great responsibility at this moment.",
    "Q In this backdrop how important is it to send the educated younger generation to parliament?",
    "This is very important. The younger generation is hot-blooded and aggressive. They have the energy. And the present younger generation is updated with knowledge. The world is a global village now. It is a global economy. The doors of the parliament should be opened for the younger generation. According to the latest population statistics one fourth of our population is youth and also women are around 50 percent. But what is the female representation in our parliament? Below when we consider those in the age group of 30 years we have only 1.7 percent of them in parliament. Below 35 year its only 4.4 percent. We should be ashamed of these figures. Representation should be given to women, youth, professionals, workers, those disabled, different nationalities and religions. The Parliament should comprise a cross section of the society. Otherwise the youth will revolt. We saw this in 1971 and we also saw it in 1980s. We saw this both in the North and the South. I can remember President Premadasa appointed a Youth Commission and he attended it almost every day and followed that commission. He asked for a report within three months. It comprised of Prof. Jayatilake, Prof. G. L. Peiris and Radhika Kumaraswamy. They didn’t even take their allowances. They produced a report in three months and there were four findings. They concluded that the existing system has sent the youth away from the system. The second finding was that the youth have lost faith in the parliamentary system and political behaviour. The third was that political powers have been misused specially in the instances of making appointments to the government service. The fourth was that the existing democratic institutions were weakened. We still face these challenges. We still have not overcome them. If you take the weakening of democratic institutions, look at the 20th Amendment. What have we done? We never learnt lessons from past. There is no rule of law, independence of the judiciary and we give power centralised on one person, to appoint judges, to decide on the promotions of the judges, to appoint Police Commission which has the total authority on the police service, to appoint Public Service Commission. Where are we heading? We have not learned from the findings of the Youth Commission held in 1980s. We should not narrow it down to the existence of one family. We must think about the future of the country and we must think broadly.",
    "Q But President Ranasinghe Premadasa who closely followed those findings did forget and violently crushed the youth uprising in 1989?",
    "We have to be fair by all sides. When I was going to take oaths as a MP I had nominated a young man called Lucian Titus as my private secretary. He was killed a week before. Then I nominated one Ananda Wimalaweera and he too was killed. The young girls who went to vote for me were harassed and got their heads shaven. Jothipala Munasinghe, a trade union leader, and his wife, a teacher by the name of Nanda Munasinghe ,were killed. And when we attended the funeral procession we were ordered not to raise the coffin above the knees. The people in the village feared to attend the funeral. It was me and my father with others who attended the funeral. We lived in a terrible era like that. The shops had to be closed when a chit was issued. Those who were involved in politics were asked to resign and they were hung. When President Premadasa assumed power he openly said that he was ready to come to any jungle with closed eyes and we would solve this problem with discussion sans killings. Democracy was at stake. There was no hope for a society that wanted to protect democracy. There were signs of the society heading towards dictatorship and when there were no responses for President Premadasa’s pleas he had to hand things over to the military to control armed groups. It is not a time to point fingers at each other. We must learn from the past and we must protect the democratic rights of the society. We must ensure inter-party democracy and the democracy outside the party as well. When the space for democracy is curtailed it would lead to repression.",
    "The younger generation is hot-blooded and aggressive. They have the energy. And the present younger generation is updated with knowledge. The world is a global village now. It is a global economy. The doors of the parliament should be opened for the younger generation",
    "Q We talked about the violence and terror in the past. We even see at present this violent suppression is still continuing to control voices of dissent and arrest those protesting against those in power. Isn’t this vicious circle repeating over and over again?",
    "I agree. Suppression is a sign of going dictatorship. If we are doing the right thing and if we can be patient when our mistakes are pointed out there is no need to go for suppression. The government is adopting suppression because it has failed. During my political career I have never seen a government that resembled a sinking ship within a short period of just two years. Within two years this government sank. That failure is proven with the government bringing another Presidential candidate just within two years. The president can go for two terms. They want to replace the president and it is new face. A new saviour has been introduced. This proves the failure and incapability of the government. When a ship is going to sink those inside blame each other. That fight has started within the government. We are seeing now what we have seen in the history of politics.",
    "Q But this is a powerful government which received 6.9 million votes and as some claimed it is the first and the only government that came to power with a Sinhala only majority vote. But could the SJB or any other opposition party give a fight to this government?",
    "It has been proved beyond doubt that this government has failed. There are problems within the government. From which side has this government been successful? Look at the finance? Look at the damage caused to the environment. There are allegations that this government is heading for dictatorship. There are allegations that this government is heading for a family led tribal ruling system. There are allegations that this government has weakened the democratic institutions. People are starving. Jobs have been lost. There is no income. All businesses have come to an end. The government that came to power clamouring for patriotism is selling lands to their cronies bypassing all legal and accepted rules and regulations. Look at the foreign policy. Since they cannot manage the foreign policy they have put the entire future in a danger. Our foreign policy has led the country to become the centre or a battle ground of international power houses. I can go on and on. So the bottom-line is we have failed. The SJB is a new team and we are an extension of the UNP. Why did we have to form the SJB? Because the UNP Working Committee decided and it was forced on the Working Committee and party representatives from village level to the MPs. The way we are going is not correct. We told that we have to change the way. We wanted to select a new leader. A new political movement had to be started. It was the decision of the Working Committee. But certain leaders decided to handover a separate list regarding nominations. We had no place to go. We could not even find the addresses of our branches, but within a short period we faced the election and the people decided that the main political movement is the SJB. We had a struggle for democracy within the party. There were lifetime leaders. But we invite everyone to read the constitution of our party. Every year the leader has to be selected with the decision of the grassroots level.",
    "Q Do you thing that the UNP should join the SJB?",
    "This is a democratic country. We need the support of everyone to win this battle. There are many UNPers who are joining. I am sure young leaders like Ruwan Wijewardene and those others who love this country would join us. At the right time and the right moment they would join us.",
    "Representation should be given to women, youth, professionals, workers, those disabled, different nationalities and religions. The Parliament should comprise a cross section of the society. Otherwise the youth will revolt. We saw this in 1971 and we also saw it in 1980s.",
    "Q It is said that Ranil Wickremesinge is one the best leaders who can see the political future of the country. UNP was your party and it was the party of your father. What happened to the UNP?",
    "What is most important is internal democracy of the party. If we don’t have it we would be caught up. If it was not there, even a party could lead to a dictatorship. Since we lost the democracy and as some were trying to appoint lifetime leaders we have been punished. Our party was not sensitive with the people. We only thought about the people when there is an election and people have given a mandate. I personally don’t blame Mr. Wickremesinghe. But we have to respect the democratic decisions of the party members and the people. That is democracy.",
    "Q But we see that the UNP has removed the party membership of some of the local council members and mayors leading to the loss of local councils that are their in the party. How do you see this?",
    "Who is going to gain from this and who would be benefited from this? We know very well who is going to benefit. People are questioning about political wheeler-dealings. We must go for a principled political culture. We need a parliament that works and speaks on principles. We have not learned.",
    "Q Though you are a Muslim we know that you closely associate with Sinhalese and other communities. And you studied in a Sinhala school. We see that over the recent past there were talks about Muslim extremism and this became worse specially after the suicidal attack on an Easter Sunday in 2019. What is your message on this?",
    "We have seen this during the history. There was a time when an anti-Jewish campaign was promoted in the world. Millions of people died. Then there was anti-communist campaign. The latest is Islamphobia. We cannot get rid of these influences. When reporting about Nelson Mandela and Yassar Arfath, the powerful international media tagged the word terrorist in front of their names. But when South Africa was freed, Mandela proved who he really was. He did not hate the Whites. He acted with foresight. Today in the Europe Mandela’s statues have been built and he is widely respected. During different eras the arms dealers need wars to sell weapons. Such activities are been justified by brainwashing people. We have seen this repeated in world history. We must be mature and educated enough to understand these. There is extremism in every community. Look at the Easter Sunday attack. There was no issue between the Muslim and Christians in this country. There are agendas behind these terrible incidents. We must be educated to understand these."
  ]
}